[
  {
    "title": "Specificity",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity",
    "summary": "Specificity is the means by which browsers decide which CSS property values are the most relevant to an element and, therefore, will be applied. Specificity is based on the matching rules which are composed of different sorts of CSS selectors."
  },
  {
    "title": "display",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display",
    "summary": "The display CSS property sets whether an element is treated as a block or inline element and the layout used for its children, such as flow layout, grid or flex."
  },
  {
    "title": "position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/position",
    "summary": "The position CSS property sets how an element is positioned in a document. The top, right, bottom, and left properties determine the final location of positioned elements."
  },
  {
    "title": "box-shadow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-shadow",
    "summary": "The box-shadow CSS property adds shadow effects around an element's frame. You can set multiple effects separated by commas. A box shadow is described by X and Y offsets relative to the element, blur and spread radius, and color."
  },
  {
    "title": "background-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-color",
    "summary": "The background-color CSS property sets the background color of an element."
  },
  {
    "title": "width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/width",
    "summary": "The width CSS property sets an element's width. By default, it sets the width of the content area, but if box-sizing is set to border-box, it sets the width of the border area."
  },
  {
    "title": "justify-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/justify-content",
    "summary": "The CSS justify-content property defines how the browser distributes space between and around content items along the main-axis of a flex container, and the inline axis of a grid container."
  },
  {
    "title": "background-image",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-image",
    "summary": "The background-image CSS property sets one or more background images on an element."
  },
  {
    "title": "cursor",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/cursor",
    "summary": "The cursor CSS property sets the mouse cursor, if any, to show when the mouse pointer is over an element."
  },
  {
    "title": "height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/height",
    "summary": "The height CSS property specifies the height of an element. By default, the property defines the height of the content area. If box-sizing is set to border-box, however, it instead determines the height of the border area."
  },
  {
    "title": "border",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border",
    "summary": "The border shorthand CSS property sets an element's border. It sets the values of border-width, border-style, and border-color."
  },
  {
    "title": "font-weight",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-weight",
    "summary": "The font-weight CSS property sets the weight (or boldness) of the font. The weights available depend on the font-family that is currently set."
  },
  {
    "title": "font-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-size",
    "summary": "The font-size CSS property sets the size of the font. Changing the font size also updates the sizes of the font size-relative <length> units, such as em, ex, and so forth."
  },
  {
    "title": "box-sizing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-sizing",
    "summary": "The box-sizing CSS property sets how the total width and height of an element is calculated."
  },
  {
    "title": "overflow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow",
    "summary": "The overflow CSS shorthand property sets the desired behavior for an element's overflow — i.e. when an element's content is too big to fit in its block formatting context — in both directions."
  },
  {
    "title": "grid-template-columns",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-template-columns",
    "summary": "The grid-template-columns CSS property defines the line names and track sizing functions of the grid columns."
  },
  {
    "title": "border-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-radius",
    "summary": "The border-radius CSS property rounds the corners of an element's outer border edge. You can set a single radius to make circular corners, or two radii to make elliptical corners."
  },
  {
    "title": "font-family",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-family",
    "summary": "The font-family CSS property specifies a prioritized list of one or more font family names and/or generic family names for the selected element."
  },
  {
    "title": "padding",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding",
    "summary": "The padding CSS shorthand property sets the padding area on all four sides of an element at once."
  },
  {
    "title": "transform",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform",
    "summary": "The transform CSS property lets you rotate, scale, skew, or translate an element.\n  It modifies the coordinate space of the CSS visual formatting model."
  },
  {
    "title": "background-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-size",
    "summary": "The background-size CSS property sets the size of the element's background image.\n  The image can be left to its natural size, stretched, or constrained to fit the available space."
  },
  {
    "title": "vertical-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/vertical-align",
    "summary": "The vertical-align CSS property sets vertical alignment of an inline, inline-block or table-cell box."
  },
  {
    "title": "margin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin",
    "summary": "The margin CSS shorthand property sets the margin area on all four sides of an element."
  },
  {
    "title": ":nth-child()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-child",
    "summary": "The :nth-child() CSS pseudo-class matches elements based on their position among a group of siblings."
  },
  {
    "title": "object-fit",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/object-fit",
    "summary": "The object-fit CSS property sets how the content of a replaced element, such as an <img> or <video>, should be resized to fit its container."
  },
  {
    "title": "background",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background",
    "summary": "The background shorthand CSS property sets all background style properties at once, such as color, image, origin and size, or repeat method."
  },
  {
    "title": "color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/color",
    "summary": "The color CSS property sets the foreground color value of an element's text and text decorations, and sets the <currentcolor> value. currentcolor may be used as an indirect value on other properties and is the default for other color properties, such as border-color."
  },
  {
    "title": "flex",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex",
    "summary": "The flex CSS shorthand property sets how a flex item will grow or shrink to fit the space available in its flex container."
  },
  {
    "title": "text-overflow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-overflow",
    "summary": "The text-overflow CSS property sets how hidden overflow content is signaled to users. It can be clipped, display an ellipsis ('…'), or display a custom string."
  },
  {
    "title": "text-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-align",
    "summary": "The text-align CSS property sets the horizontal alignment of the content inside a block element or table-cell box. This means it works like vertical-align but in the horizontal direction."
  },
  {
    "title": "text-decoration",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration",
    "summary": "The text-decoration shorthand CSS property sets the appearance of decorative lines on text. It is a shorthand for text-decoration-line, text-decoration-color, text-decoration-style, and the newer text-decoration-thickness property."
  },
  {
    "title": "line-height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/line-height",
    "summary": "The line-height CSS property sets the height of a line box. It's commonly used to set the distance between lines of text. On block-level elements, it specifies the minimum height of line boxes within the element. On non-replaced inline elements, it specifies the height that is used to calculate line box height."
  },
  {
    "title": ":not()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:not",
    "summary": "The :not() CSS pseudo-class represents elements that do not match a list of selectors. Since it prevents specific items from being selected, it is known as the negation pseudo-class."
  },
  {
    "title": "white-space",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/white-space",
    "summary": "The white-space CSS property sets how white space inside an element is handled."
  },
  {
    "title": "align-items",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/align-items",
    "summary": "The CSS align-items property sets the align-self value on all direct children as a group. In Flexbox, it controls the alignment of items on the Cross Axis. In Grid Layout, it controls the alignment of items on the Block Axis within their grid area."
  },
  {
    "title": "border-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-style",
    "summary": "The border-style shorthand CSS property sets the line style for all four sides of an element's border."
  },
  {
    "title": "flex-direction",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-direction",
    "summary": "The flex-direction CSS property sets how flex items are placed in the flex container defining the main axis and the direction (normal or reversed)."
  },
  {
    "title": "flex-basis",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-basis",
    "summary": "The flex-basis CSS property sets the initial main size of a flex item. It sets the size of the content box unless otherwise set with box-sizing."
  },
  {
    "title": "Pseudo-classes",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Pseudo-classes",
    "summary": "A CSS pseudo-class is a keyword added to a selector that specifies a special state of the selected element(s). For example, :hover can be used to change a button's color when the user's pointer hovers over it."
  },
  {
    "title": "background-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-position",
    "summary": "The background-position CSS property sets the initial position for each background image. The position is relative to the position layer set by background-origin."
  },
  {
    "title": "text-transform",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-transform",
    "summary": "The text-transform CSS property specifies how to capitalize an element's text. It can be used to make text appear in all-uppercase or all-lowercase, or with each word capitalized. It also can help improve legibility for ruby."
  },
  {
    "title": "CSS reference",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Reference",
    "summary": "Use this CSS reference to browse an alphabetical index of all of the standard CSS properties, pseudo-classes, pseudo-elements, data types, functional notations and at-rules. You can also browse key CSS concepts and a list of selectors organized by type. Also included is a brief DOM-CSS / CSSOM reference."
  },
  {
    "title": "flex-grow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-grow",
    "summary": "The flex-grow CSS property sets the flex grow factor of a flex item's main size."
  },
  {
    "title": "linear-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/linear-gradient",
    "summary": "The linear-gradient() CSS function creates an image consisting of a progressive transition between two or more colors along a straight line. Its result is an object of the <gradient> data type, which is a special kind of <image>."
  },
  {
    "title": "z-index",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/z-index",
    "summary": "The z-index CSS property sets the z-order of a positioned element and its descendants or flex items. Overlapping elements with a larger z-index cover those with a smaller one."
  },
  {
    "title": "backdrop-filter",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/backdrop-filter",
    "summary": "The backdrop-filter CSS property lets you apply graphical effects such as blurring or color shifting to the area behind an element. Because it applies to everything behind the element, to see the effect you must make the element or its background at least partially transparent."
  },
  {
    "title": "flex-wrap",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-wrap",
    "summary": "The flex-wrap CSS property sets whether flex items are forced onto one line or can wrap onto multiple lines. If wrapping is allowed, it sets the direction that lines are stacked."
  },
  {
    "title": "pointer-events",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/pointer-events",
    "summary": "The pointer-events CSS property sets under what circumstances (if any) a particular graphic element can become the target of pointer events."
  },
  {
    "title": "filter",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter",
    "summary": "The filter CSS property applies graphical effects like blur or color shift to an element. Filters are commonly used to adjust the rendering of images, backgrounds, and borders."
  },
  {
    "title": "float",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/float",
    "summary": "The float CSS property places an element on the left or right side of its container, allowing text and inline elements to wrap around it. The element is removed from the normal flow of the page, though still remaining a part of the flow (in contrast to absolute positioning)."
  },
  {
    "title": "@font-face",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face",
    "summary": "The @font-face CSS at-rule specifies a custom font with which to display text; the font can be loaded from either a remote server or a locally-installed font on the user's own computer."
  },
  {
    "title": "grid-column",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-column",
    "summary": "The grid-column CSS shorthand property specifies a grid item's size and location within a grid column by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the inline-start and inline-end edge of its grid area."
  },
  {
    "title": "overflow-wrap",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-wrap",
    "summary": "The overflow-wrap CSS property applies to inline elements, setting whether the browser should insert line breaks within an otherwise unbreakable string to prevent text from overflowing its line box."
  },
  {
    "title": "transition",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transition",
    "summary": "The transition CSS property is a shorthand property for transition-property, transition-duration, transition-timing-function, and transition-delay."
  },
  {
    "title": "list-style-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/list-style-type",
    "summary": "The list-style-type CSS property sets the marker (such as a disc, character, or custom counter style) of a list item element."
  },
  {
    "title": "fit-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/fit-content",
    "summary": "The fit-content behaves as fit-content(stretch). In practice this means that the box will use the available space, but never more than max-content."
  },
  {
    "title": "aspect-ratio",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/aspect-ratio",
    "summary": "The aspect-ratio CSS property sets a preferred aspect ratio for the box, which will be used in the calculation of auto sizes and some other layout functions."
  },
  {
    "title": "list-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/list-style",
    "summary": "The list-style CSS shorthand property allows you to set all the list style properties at once."
  },
  {
    "title": "::before",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::before",
    "summary": "In CSS, ::before creates a pseudo-element that is the first child of the selected element. It is often used to add cosmetic content to an element with the content property. It is inline by default."
  },
  {
    "title": "::after",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::after",
    "summary": "In CSS, ::after creates a pseudo-element that is the last child of the selected element. It is often used to add cosmetic content to an element with the content property. It is inline by default."
  },
  {
    "title": "clip-path",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/clip-path",
    "summary": "The clip-path CSS property creates a clipping region that sets what part of an element should be shown. Parts that are inside the region are shown, while those outside are hidden."
  },
  {
    "title": "color-scheme",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/color-scheme",
    "summary": "The color-scheme CSS property allows an element to indicate which color schemes it can comfortably be rendered in."
  },
  {
    "title": ":first-child",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first-child",
    "summary": "The :first-child CSS pseudo-class represents the first element among a group of sibling elements."
  },
  {
    "title": "animation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation",
    "summary": "The animation shorthand CSS property applies an animation between styles. It is a shorthand for animation-name, animation-duration, animation-timing-function, animation-delay, animation-iteration-count, animation-direction, animation-fill-mode, and animation-play-state."
  },
  {
    "title": "word-break",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/word-break",
    "summary": "The word-break CSS property sets whether line breaks appear wherever the text would otherwise overflow its content box."
  },
  {
    "title": "touch-action",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/touch-action",
    "summary": "The touch-action CSS property sets how an element's region can be manipulated by a touchscreen user (for example, by zooming features built into the browser)."
  },
  {
    "title": ":hover",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:hover",
    "summary": "The :hover CSS pseudo-class matches when the user interacts with an element with a pointing device, but does not necessarily activate it. It is generally triggered when the user hovers over an element with the cursor (mouse pointer)."
  },
  {
    "title": "gap",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gap",
    "summary": "The gap CSS property sets the gaps (gutters) between rows and columns. It is a shorthand for row-gap and column-gap."
  },
  {
    "title": "transform-origin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-origin",
    "summary": "The transform-origin CSS property sets the origin for an element's transformations."
  },
  {
    "title": "::placeholder",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::placeholder",
    "summary": "The ::placeholder CSS pseudo-element represents the placeholder text in an <input> or <textarea> element."
  },
  {
    "title": "flex-shrink",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-shrink",
    "summary": "The flex-shrink CSS property sets the flex shrink factor of a flex item. If the size of all flex items is larger than the flex container, items shrink to fit according to flex-shrink."
  },
  {
    "title": "@media",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media",
    "summary": "The @media CSS at-rule can be used to apply part of a style sheet based on the result of one or more media queries. With it, you specify a media query and a block of CSS to apply to the document if and only if the media query matches the device on which the content is being used."
  },
  {
    "title": "max-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max-width",
    "summary": "The max-width CSS property sets the maximum width of an element. It prevents the used value of the width property from becoming larger than the value specified by max-width."
  },
  {
    "title": "scroll-behavior",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-behavior",
    "summary": "The scroll-behavior CSS property sets the behavior for a scrolling box when scrolling is triggered by the navigation or CSSOM scrolling APIs."
  },
  {
    "title": "grid-template-rows",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-template-rows",
    "summary": "The grid-template-rows CSS property defines the line names and track sizing functions of the grid rows."
  },
  {
    "title": "@keyframes",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@keyframes",
    "summary": "The @keyframes CSS at-rule controls the intermediate steps in a CSS animation sequence by defining styles for keyframes (or waypoints) along the animation sequence. This gives more control over the intermediate steps of the animation sequence than transitions."
  },
  {
    "title": "Pseudo-elements",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Pseudo-elements",
    "summary": "A CSS pseudo-element is a keyword added to a selector that lets you style a specific part of the selected element(s). For example, ::first-line can be used to change the font of the first line of a paragraph."
  },
  {
    "title": "letter-spacing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/letter-spacing",
    "summary": "The letter-spacing CSS property sets the horizontal spacing behavior between text characters. This value is added to the natural spacing between characters while rendering the text. Positive values of letter-spacing causes characters to spread farther apart, while negative values of letter-spacing bring characters closer together."
  },
  {
    "title": "font-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-style",
    "summary": "The font-style CSS property sets whether a font should be styled with a normal, italic, or oblique face from its font-family."
  },
  {
    "title": "left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/left",
    "summary": "The left CSS property participates in specifying the horizontal position of a positioned element. It has no effect on non-positioned elements."
  },
  {
    "title": ":last-child",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:last-child",
    "summary": "The :last-child CSS pseudo-class represents the last element among a group of sibling elements."
  },
  {
    "title": "scrollbar-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scrollbar-width",
    "summary": "The scrollbar-width property allows the author to set the maximum thickness of an element's scrollbars when they are shown."
  },
  {
    "title": "table-layout",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/table-layout",
    "summary": "The table-layout CSS property sets the algorithm used to lay out <table> cells, rows, and columns."
  },
  {
    "title": "opacity",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/opacity",
    "summary": "The opacity CSS property sets the opacity of an element. Opacity is the degree to which content behind an element is hidden, and is the opposite of transparency."
  },
  {
    "title": ":has()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:has",
    "summary": "The :has() CSS pseudo-class represents an element if any of the selectors passed as parameters (relative to the :scope of the given element) match at least one element."
  },
  {
    "title": "text-shadow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-shadow",
    "summary": "The text-shadow CSS property adds shadows to text. It accepts a comma-separated list of shadows to be applied to the text and any of its decorations. Each shadow is described by some combination of X and Y offsets from the element, blur radius, and color."
  },
  {
    "title": "margin-left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-left",
    "summary": "The margin-left CSS property sets the margin area on the left side of an element. A positive value places it farther from its neighbors, while a negative value places it closer."
  },
  {
    "title": "grid-template-areas",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-template-areas",
    "summary": "The grid-template-areas CSS property specifies named grid areas, establishing the cells in the grid and assigning them names."
  },
  {
    "title": ":active",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:active",
    "summary": "The :active CSS pseudo-class represents an element (such as a button) that is being activated by the user. When using a mouse, \"activation\" typically starts when the user presses down the primary mouse button."
  },
  {
    "title": "calc()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/calc",
    "summary": "The calc() CSS function lets you perform calculations when specifying CSS property values. It can be used anywhere a <length>, <frequency>, <angle>, <time>, <percentage>, <number>, or <integer> is allowed."
  },
  {
    "title": "align-self",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/align-self",
    "summary": "The align-self CSS property overrides a grid or flex item's align-items value. In Grid, it aligns the item inside the grid area. In Flexbox, it aligns the item on the cross axis."
  },
  {
    "title": ":focus",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus",
    "summary": "The :focus CSS pseudo-class represents an element (such as a form input) that has received focus. It is generally triggered when the user clicks or taps on an element or selects it with the keyboard's Tab key."
  },
  {
    "title": "prefers-color-scheme",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-color-scheme",
    "summary": "The prefers-color-scheme CSS media feature is used to detect if the user has requested a light or dark color theme."
  },
  {
    "title": ":nth-of-type()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-of-type",
    "summary": "The :nth-of-type() CSS pseudo-class matches elements based on their position among siblings of the same type (tag name)."
  },
  {
    "title": "content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/content",
    "summary": "The content CSS property replaces an element with a generated value. Objects inserted using the content property are anonymous replaced elements."
  },
  {
    "title": "object-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/object-position",
    "summary": "The object-position CSS property specifies the alignment of the selected replaced element's contents within the element's box. Areas of the box which aren't covered by the replaced element's object will show the element's background."
  },
  {
    "title": "text-size-adjust",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-size-adjust",
    "summary": "The text-size-adjust CSS property controls the text inflation algorithm used on some smartphones and tablets. Other browsers will ignore this property."
  },
  {
    "title": "margin-top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-top",
    "summary": "The margin-top CSS property sets the margin area on the top of an element. A positive value places it farther from its neighbors, while a negative value places it closer."
  },
  {
    "title": "grid-auto-columns",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-auto-columns",
    "summary": "The grid-auto-columns CSS property specifies the size of an implicitly-created grid column track or pattern of tracks."
  },
  {
    "title": "border-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-color",
    "summary": "The border-color shorthand CSS property sets the color of an element's border."
  },
  {
    "title": "font",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font",
    "summary": "The font CSS shorthand property sets all the different properties of an element's font. Alternatively, it sets an element's font to a system font."
  },
  {
    "title": "top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/top",
    "summary": "The top CSS property participates in specifying the vertical position of a positioned element. It has no effect on non-positioned elements."
  },
  {
    "title": "rotate()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/rotate",
    "summary": "The rotate() CSS function defines a transformation that rotates an element around a\n  fixed point on the 2D plane, without deforming it. Its result is a <transform-function> data\n  type."
  },
  {
    "title": "mix-blend-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mix-blend-mode",
    "summary": "The mix-blend-mode CSS property sets how an element's content should blend with the content of the element's parent and the element's background."
  },
  {
    "title": ":focus-visible",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus-visible",
    "summary": "The :focus-visible pseudo-class applies while an element matches the :focus pseudo-class and the UA (User Agent) determines via heuristics that the focus should be made evident on the element. (Many browsers show a \"focus ring\" by default in this case.)"
  },
  {
    "title": "background-clip",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-clip",
    "summary": "The background-clip CSS property sets whether an element's background extends underneath its border box, padding box, or content box."
  },
  {
    "title": "align-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/align-content",
    "summary": "The CSS align-content property sets the distribution of space between and around content items along a flexbox's cross-axis or a grid's block axis."
  },
  {
    "title": "border-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-width",
    "summary": "The border-width shorthand CSS property sets the width of an element's border."
  },
  {
    "title": "visibility",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/visibility",
    "summary": "The visibility CSS property shows or hides an element without changing the layout of a document. The property can also hide rows or columns in a <table>."
  },
  {
    "title": "text-orientation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-orientation",
    "summary": "The text-orientation CSS property sets the orientation of the text characters in a line. It only affects text in vertical mode (when writing-mode is not horizontal-tb). It is useful for controlling the display of languages that use vertical script, and also for making vertical table headers."
  },
  {
    "title": "overflow-x",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-x",
    "summary": "The overflow-x CSS property sets what shows when content overflows a block-level element's left and right edges. This may be nothing, a scroll bar, or the overflow content."
  },
  {
    "title": ":root",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:root",
    "summary": "The :root CSS pseudo-class matches the root element of a tree representing the document. In HTML, :root represents the <html> element and is identical to the selector html, except that its specificity is higher."
  },
  {
    "title": "grid-row",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-row",
    "summary": "The grid-row CSS shorthand property specifies a grid item's size and location within the grid row by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the inline-start and inline-end edge of its grid area."
  },
  {
    "title": "justify-self",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/justify-self",
    "summary": "The CSS justify-self property sets the way a box is justified inside its alignment container along the appropriate axis."
  },
  {
    "title": "border-collapse",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-collapse",
    "summary": "The border-collapse CSS property sets whether cells inside a <table> have shared or separate borders."
  },
  {
    "title": "background-repeat",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-repeat",
    "summary": "The background-repeat CSS property sets how background images are repeated. A background image can be repeated along the horizontal and vertical axes, or not repeated at all."
  },
  {
    "title": "Custom properties (--*): CSS variables",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/--*",
    "summary": "Property names that are prefixed with --, like --example-name, represent custom properties that contain a value that can be used in other declarations using the var() function."
  },
  {
    "title": "outline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/outline",
    "summary": "The outline CSS shorthand property sets most of the outline properties in a single declaration."
  },
  {
    "title": "scale()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scale",
    "summary": "The scale() CSS function defines a transformation that resizes an element on the 2D\n  plane. Because the amount of scaling is defined by a vector, it can resize the horizontal and vertical dimensions at\n  different scales. Its result is a <transform-function> data type."
  },
  {
    "title": "translate()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translate",
    "summary": "The translate() CSS function repositions an element in the horizontal and/or vertical\n  directions. Its result is a <transform-function> data type."
  },
  {
    "title": "margin-bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-bottom",
    "summary": "The margin-bottom CSS property sets the margin area on the bottom of an element. A positive value places it farther from its neighbors, while a negative value places it closer."
  },
  {
    "title": "grid-auto-rows",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-auto-rows",
    "summary": "The grid-auto-rows CSS property specifies the size of an implicitly-created grid row track or pattern of tracks."
  },
  {
    "title": "grid-auto-flow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-auto-flow",
    "summary": "The grid-auto-flow CSS property controls how the auto-placement algorithm works, specifying exactly how auto-placed items get flowed into the grid."
  },
  {
    "title": "column-gap",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-gap",
    "summary": "The column-gap CSS property sets the size of the gap (gutter) between an element's columns."
  },
  {
    "title": "font-display",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-display",
    "summary": "The font-display descriptor determines how a font face is displayed based on whether and when it is downloaded and ready to use."
  },
  {
    "title": "grid-template",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-template",
    "summary": "The grid-template CSS property is a shorthand property for defining grid columns, rows, and areas."
  },
  {
    "title": "<transform-function>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function",
    "summary": "The <transform-function> CSS data type represents a transformation that affects an element's appearance. Transformation functions can rotate, resize, distort, or move an element in 2D or 3D space. It is used in the transform property."
  },
  {
    "title": "grid-area",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-area",
    "summary": "The grid-area CSS shorthand property specifies a grid item's size and location within a grid by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the edges of its grid area."
  },
  {
    "title": "appearance",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/appearance",
    "summary": "The appearance CSS property is used to control native appearance of UI controls, that are based on operating system's theme."
  },
  {
    "title": "zoom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/zoom",
    "summary": "The non-standard zoom CSS property can be used to control the magnification level of an element. transform: scale() should be used instead of this property, if possible. However, unlike CSS Transforms, zoom affects the layout size of the element."
  },
  {
    "title": "@import",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@import",
    "summary": "The @import CSS at-rule is used to import style rules from other stylesheets."
  },
  {
    "title": ":checked",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:checked",
    "summary": "The :checked CSS pseudo-class selector represents any radio (<input type=\"radio\">), checkbox (<input type=\"checkbox\">), or option (<option> in a <select>) element that is checked or toggled to an on state."
  },
  {
    "title": "border-spacing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-spacing",
    "summary": "The border-spacing CSS property sets the distance between the borders of adjacent cells in a <table>. This property applies only when border-collapse is separate."
  },
  {
    "title": "animation-direction",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-direction",
    "summary": "The animation-direction CSS property sets whether an animation should play forward, backward, or alternate back and forth between playing the sequence forward and backward."
  },
  {
    "title": "::marker",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::marker",
    "summary": "The ::marker CSS pseudo-element selects the marker box of a list item, which typically contains a bullet or number. It works on any element or pseudo-element set to display: list-item, such as the <li> and <summary> elements."
  },
  {
    "title": "drop-shadow()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/drop-shadow",
    "summary": "The drop-shadow() CSS function applies a drop shadow effect to the input image. Its result is a <filter-function>."
  },
  {
    "title": "transition-delay",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transition-delay",
    "summary": "The transition-delay CSS property specifies the duration to wait before starting a property's transition effect when its value changes."
  },
  {
    "title": "order",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/order",
    "summary": "The order CSS property sets the order to lay out an item in a flex or grid container. Items in a container are sorted by ascending order value and then by their source code order."
  },
  {
    "title": "animation-timing-function",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-timing-function",
    "summary": "The animation-timing-function CSS property sets how an animation progresses through the duration of each cycle."
  },
  {
    "title": "line-break",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/line-break",
    "summary": "The line-break CSS property sets how to break lines of Chinese, Japanese, or Korean (CJK) text when working with punctuation and symbols."
  },
  {
    "title": "right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/right",
    "summary": "The right CSS property participates in specifying the horizontal position of a positioned element. It has no effect on non-positioned elements."
  },
  {
    "title": "border-image",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image",
    "summary": "The border-image CSS property draws an image around a given element. It replaces the element's regular border."
  },
  {
    "title": "border-bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom",
    "summary": "The border-bottom shorthand CSS property sets an element's bottom border. It sets the values of border-bottom-width, border-bottom-style and border-bottom-color."
  },
  {
    "title": "font-smooth",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-smooth",
    "summary": "The font-smooth CSS property controls the application of anti-aliasing when fonts are rendered."
  },
  {
    "title": "user-select",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/user-select",
    "summary": "The user-select CSS property controls whether the user can select text. This doesn't have any effect on content loaded as part of a browser's user interface (its chrome), except in textboxes."
  },
  {
    "title": "min-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min-width",
    "summary": "The min-width CSS property sets the minimum width of an element. It prevents the used value of the width property from becoming smaller than the value specified for min-width."
  },
  {
    "title": "scrollbar-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scrollbar-color",
    "summary": "The scrollbar-color CSS property sets the color of the scrollbar track and thumb."
  },
  {
    "title": ":first-of-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first-of-type",
    "summary": "The :first-of-type CSS pseudo-class represents the first element of its type among a group of sibling elements."
  },
  {
    "title": "animation-delay",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-delay",
    "summary": "The animation-delay CSS property specifies the amount of time to wait from applying the animation to an element before beginning to perform the animation. The animation can start later, immediately from its beginning, or immediately and partway through the animation."
  },
  {
    "title": "scroll-snap-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-type",
    "summary": "The scroll-snap-type CSS property sets how strictly snap points are enforced on the scroll container in case there is one."
  },
  {
    "title": "animation-fill-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-fill-mode",
    "summary": "The animation-fill-mode CSS property sets how a CSS animation applies styles to its target before and after its execution."
  },
  {
    "title": "background-attachment",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-attachment",
    "summary": "The background-attachment CSS property sets whether a background image's position is fixed within the viewport, or scrolls with its containing block."
  },
  {
    "title": "min-height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min-height",
    "summary": "The min-height CSS property sets the minimum height of an element. It prevents the used value of the height property from becoming smaller than the value specified for min-height."
  },
  {
    "title": "resize",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/resize",
    "summary": "The resize CSS property sets whether an element is resizable, and if so, in which directions."
  },
  {
    "title": "row-gap",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/row-gap",
    "summary": "The row-gap CSS property sets the size of the gap (gutter) between an element's rows."
  },
  {
    "title": ":disabled",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:disabled",
    "summary": "The :disabled CSS pseudo-class represents any disabled element. An element is disabled if it can't be activated (selected, clicked on, typed into, etc.) or accept focus. The element also has an enabled state, in which it can be activated or accept focus."
  },
  {
    "title": "margin-right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-right",
    "summary": "The margin-right CSS property sets the margin area on the right side of an element. A positive value places it farther from its neighbors, while a negative value places it closer."
  },
  {
    "title": "max-height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max-height",
    "summary": "The max-height CSS property sets the maximum height of an element. It prevents the used value of the height property from becoming larger than the value specified for max-height."
  },
  {
    "title": "radial-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/radial-gradient",
    "summary": "The radial-gradient() CSS function creates an image consisting of a progressive transition between two or more colors that radiate from an origin. Its shape may be a circle or an ellipse. The function's result is an object of the <gradient> data type, which is a special kind of <image>."
  },
  {
    "title": "overscroll-behavior",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overscroll-behavior",
    "summary": "The overscroll-behavior CSS property sets what a browser does when reaching the boundary of a scrolling area. It's a shorthand for overscroll-behavior-x and overscroll-behavior-y."
  },
  {
    "title": "transition-property",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transition-property",
    "summary": "The transition-property CSS property sets the CSS properties to which a transition effect should be applied."
  },
  {
    "title": ":last-of-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:last-of-type",
    "summary": "The :last-of-type CSS pseudo-class represents the last element of its type among a group of sibling elements."
  },
  {
    "title": "<length>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/length",
    "summary": "The <length> CSS data type represents a distance value. Lengths can be used in numerous CSS properties, such as width, height, margin, padding, border-width, font-size, and text-shadow."
  },
  {
    "title": "inset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset",
    "summary": "The inset CSS property is a shorthand that corresponds to the top, right, bottom, and/or left properties. It has the same multi-value syntax of the margin shorthand."
  },
  {
    "title": ":focus-within",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:focus-within",
    "summary": "The :focus-within CSS pseudo-class matches an element if the element or any of its descendants are focused. In other words, it represents an element that is itself matched by the :focus pseudo-class or has a descendant that is matched by :focus. (This includes descendants in shadow trees.)"
  },
  {
    "title": "unset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/unset",
    "summary": "The unset CSS keyword resets a property to its inherited value if the property naturally inherits from its parent, and to its initial value if not. In other words, it behaves like the inherit keyword in the first case, when the property is an inherited property, and like the initial keyword in the second case, when the property is a non-inherited property."
  },
  {
    "title": "mask-image",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-image",
    "summary": "The mask-image CSS property sets the image that is used as mask layer for an element.\n  By default this means the alpha channel of the mask image will be multiplied with the alpha channel of the element. This can be controlled with the mask-mode property."
  },
  {
    "title": "transition-timing-function",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transition-timing-function",
    "summary": "The transition-timing-function CSS property sets how intermediate values are calculated for CSS properties being affected by a transition effect."
  },
  {
    "title": "accent-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/accent-color",
    "summary": "The accent-color CSS property sets the accent color for user-interface controls generated by some elements."
  },
  {
    "title": "text-decoration-thickness",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-thickness",
    "summary": "The text-decoration-thickness CSS property sets the stroke thickness of the decoration line that is used on text in an element, such as a line-through, underline, or overline."
  },
  {
    "title": "grid",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid",
    "summary": "The grid CSS property is a shorthand property that sets all of the explicit and implicit grid properties in a single declaration."
  },
  {
    "title": "text-decoration-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-style",
    "summary": "The text-decoration-style CSS property sets the style of the lines specified by text-decoration-line. The style applies to all lines that are set with text-decoration-line."
  },
  {
    "title": "orientation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/orientation",
    "summary": "The orientation CSS media feature can be used to test the orientation of the viewport (or the page box, for paged media)."
  },
  {
    "title": "bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/bottom",
    "summary": "The bottom CSS property participates in setting the vertical position of a positioned element. It has no effect on non-positioned elements."
  },
  {
    "title": "max-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max-content",
    "summary": "The max-content sizing keyword represents the intrinsic maximum width or height of the content. For text content this means that the content will not wrap at all even if it causes overflows."
  },
  {
    "title": "flex-flow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/flex-flow",
    "summary": "The flex-flow CSS shorthand property specifies the direction of a flex container, as well as its wrapping behavior."
  },
  {
    "title": "hyphens",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/hyphens",
    "summary": "The hyphens CSS property specifies how words should be hyphenated when text wraps across multiple lines. It can prevent hyphenation entirely, hyphenate at manually-specified points within the text, or let the browser automatically insert hyphens where appropriate."
  },
  {
    "title": "animation-iteration-count",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-iteration-count",
    "summary": "The animation-iteration-count CSS property sets the number of times an animation sequence should be played before stopping."
  },
  {
    "title": ":nth-last-child()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-child",
    "summary": "The :nth-last-child() CSS pseudo-class matches elements based on their position among a group of siblings, counting from the end."
  },
  {
    "title": "background-blend-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-blend-mode",
    "summary": "The background-blend-mode CSS property sets how an element's background images should blend with each other and with the element's background color."
  },
  {
    "title": "<filter-function>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function",
    "summary": "The <filter-function> CSS data type represents a graphical effect that can change the appearance of an input image. It is used in the filter and backdrop-filter properties."
  },
  {
    "title": "clear",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/clear",
    "summary": "The clear CSS property sets whether an element must be moved below (cleared) floating elements that precede it. The clear property applies to floating and non-floating elements."
  },
  {
    "title": "will-change",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/will-change",
    "summary": "The will-change CSS property hints to browsers how an element is expected to change. Browsers may set up optimizations before an element is actually changed. These kinds of optimizations can increase the responsiveness of a page by doing potentially expensive work before they are actually required."
  },
  {
    "title": "blur()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/blur",
    "summary": "The blur() CSS function applies a Gaussian blur to the input image. Its result is a <filter-function>."
  },
  {
    "title": "prefers-reduced-motion",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-reduced-motion",
    "summary": "The prefers-reduced-motion CSS media feature is used to detect if the user has requested that the system minimize the amount of non-essential motion it uses."
  },
  {
    "title": "overflow-y",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-y",
    "summary": "The overflow-y CSS property sets what shows when content overflows a block-level element's top and bottom edges. This may be nothing, a scroll bar, or the overflow content."
  },
  {
    "title": "clamp()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/clamp",
    "summary": "The clamp() CSS function clamps a value between an upper and lower bound. clamp() enables selecting a middle value within a range of values between a defined minimum and maximum. It takes three parameters: a minimum value, a preferred value, and a maximum allowed value. The clamp() function can be used anywhere a <length>, <frequency>, <angle>, <time>, <percentage>, <number>, or <integer> is allowed."
  },
  {
    "title": "<gradient>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient",
    "summary": "The <gradient> CSS data type is a special type of <image> that consists of a progressive transition between two or more colors."
  },
  {
    "title": "caret-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/caret-color",
    "summary": "The caret-color CSS property sets the color of the insertion caret, the visible marker where the next character typed will be inserted. This is sometimes referred to as the text input cursor. The caret appears in elements such as <input> or those with the contenteditable attribute. The caret is typically a thin vertical line that flashes to help make it more noticeable. By default, it is black, but its color can be altered with this property."
  },
  {
    "title": "padding-top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-top",
    "summary": "The padding-top CSS property sets the height of the padding area on the top of an element."
  },
  {
    "title": "inherit",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inherit",
    "summary": "The inherit CSS keyword causes the element to take the computed value of the property from its parent element. It can be applied to any CSS property, including the CSS shorthand property all."
  },
  {
    "title": "list-style-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/list-style-position",
    "summary": "The list-style-position CSS property sets the position of the ::marker relative to a list item."
  },
  {
    "title": "font-feature-settings",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-feature-settings",
    "summary": "The font-feature-settings CSS property controls advanced typographic features in OpenType fonts."
  },
  {
    "title": "list-style-image",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/list-style-image",
    "summary": "The list-style-image CSS property sets an image to be used as the list item marker."
  },
  {
    "title": "mask",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask",
    "summary": "The mask CSS shorthand property hides an element (partially or fully) by masking or clipping the image at specific points."
  },
  {
    "title": "transition-duration",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transition-duration",
    "summary": "The transition-duration CSS property sets the length of time a transition animation should take to complete. By default, the value is 0s, meaning that no animation will occur."
  },
  {
    "title": "image-rendering",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image-rendering",
    "summary": "The image-rendering CSS property sets an image scaling algorithm. The property applies to an element itself, to any images set in its other properties, and to its descendants."
  },
  {
    "title": "writing-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/writing-mode",
    "summary": "The writing-mode CSS property sets whether lines of text are laid out horizontally or vertically, as well as the direction in which blocks progress. When set for an entire document, it should be set on the root element (html element for HTML documents)."
  },
  {
    "title": "text-underline-offset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-underline-offset",
    "summary": "The text-underline-offset CSS property sets the offset distance of an underline text decoration line (applied using text-decoration) from its original position."
  },
  {
    "title": "repeat()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/repeat",
    "summary": "The repeat() CSS function represents a repeated fragment of the track list, allowing a large number of columns or rows that exhibit a recurring pattern to be written in a more compact form."
  },
  {
    "title": "padding-left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-left",
    "summary": "The padding-left CSS property sets the width of the padding area to the left of an element."
  },
  {
    "title": "text-decoration-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-color",
    "summary": "The text-decoration-color CSS property sets the color of decorations added to text by text-decoration-line."
  },
  {
    "title": ":is()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:is",
    "summary": "The :is() CSS pseudo-class function takes a selector list as its argument, and selects any element that can be selected by one of the selectors in that list. This is useful for writing large selectors in a more compact form."
  },
  {
    "title": "grid-column-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-column-start",
    "summary": "The grid-column-start CSS property specifies a grid item's start position within the grid column by contributing a line, a span, or nothing (automatic) to its grid placement. This start position defines the block-start edge of the grid area."
  },
  {
    "title": ":empty",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:empty",
    "summary": "The :empty CSS pseudo-class represents any element that has no children. Children can be either element nodes or text (including whitespace). Comments, processing instructions, and CSS content do not affect whether an element is considered empty."
  },
  {
    "title": "columns",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/columns",
    "summary": "The columns CSS shorthand property sets the number of columns to use when drawing an element's contents, as well as those columns' widths."
  },
  {
    "title": "justify-items",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/justify-items",
    "summary": "The CSS justify-items property defines the default justify-self for all items of the box, giving them all a default way of justifying each box along the appropriate axis."
  },
  {
    "title": "minmax()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/minmax",
    "summary": "The minmax() CSS function defines a size range greater than or equal to min and less than or equal to max. It is used with CSS Grids."
  },
  {
    "title": "@page",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@page",
    "summary": "The @page CSS at-rule is used to modify some CSS properties when printing a document."
  },
  {
    "title": "@supports",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@supports",
    "summary": "The @supports CSS at-rule lets you specify declarations that depend on a browser's support for one or more specific CSS features. This is called a feature query. The rule may be placed at the top level of your code or nested inside any other conditional group at-rule."
  },
  {
    "title": "animation-name",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-name",
    "summary": "The animation-name CSS property specifies the names of one or more @keyframes at-rules describing the animation or animations to apply to the element."
  },
  {
    "title": "contain",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/contain",
    "summary": "The contain CSS property allows an author to indicate that an element and its contents are, as much as possible, independent of the rest of the document tree. This allows the browser to recalculate layout, style, paint, size, or any combination of them for a limited area of the DOM and not the entire page, leading to obvious performance benefits."
  },
  {
    "title": "text-decoration-line",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-line",
    "summary": "The text-decoration-line CSS property sets the kind of decoration that is used on text in an element, such as an underline or overline."
  },
  {
    "title": "<image>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image",
    "summary": "The <image> CSS data type represents a two-dimensional image."
  },
  {
    "title": "size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@page/size",
    "summary": "The size CSS at-rule descriptor, used with the @page at-rule, defines the size and orientation of the box which is used to represent a page. Most of the time, this size corresponds to the target size of the printed page if applicable."
  },
  {
    "title": "Inheritance",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inheritance",
    "summary": "In CSS, inheritance controls what happens when no value is specified for a property on an element."
  },
  {
    "title": "@layer",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@layer",
    "summary": "The @layer CSS at-rule declares a cascade layer. Rules within a cascade layer cascade together, giving more control over the cascade to web developers."
  },
  {
    "title": ":autofill",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:autofill",
    "summary": "The :autofill CSS pseudo-class matches when an <input> element has its value autofilled by the browser. The class stops matching if the user edits the field."
  },
  {
    "title": "::first-letter",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::first-letter",
    "summary": "The ::first-letter CSS pseudo-element applies styles to the first letter of the first line of a block-level element, but only when not preceded by other content (such as images or inline tables)."
  },
  {
    "title": "<easing-function>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/easing-function",
    "summary": "The <easing-function> CSS data type denotes a mathematical function that describes the rate at which a numerical value changes."
  },
  {
    "title": "direction",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/direction",
    "summary": "The direction CSS property sets the direction of text, table columns, and horizontal overflow. Use rtl for languages written from right to left (like Hebrew or Arabic), and ltr for those written from left to right (like English and most other languages)."
  },
  {
    "title": ":invalid",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:invalid",
    "summary": "The :invalid CSS pseudo-class represents any <form>, <fieldset>, <input> or other <form> element whose contents fail to validate."
  },
  {
    "title": ":where()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:where",
    "summary": "The :where() CSS pseudo-class function takes a selector list as its argument, and selects any element that can be selected by one of the selectors in that list."
  },
  {
    "title": "border-top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top",
    "summary": "The border-top shorthand CSS property sets all the properties of an element's top border."
  },
  {
    "title": "animation-play-state",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-play-state",
    "summary": "The animation-play-state CSS property sets whether an animation is running or paused."
  },
  {
    "title": "border-top-left-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top-left-radius",
    "summary": "The border-top-left-radius CSS property rounds the top-left corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner."
  },
  {
    "title": "place-items",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/place-items",
    "summary": "The CSS place-items shorthand property allows you to align items along both the block and inline directions at once (i.e. the align-items and justify-items properties) in a relevant layout system such as Grid or Flexbox. If the second value is not set, the first value is also used for it."
  },
  {
    "title": "padding-bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-bottom",
    "summary": "The padding-bottom CSS property sets the height of the padding area on the bottom of an element."
  },
  {
    "title": ":target",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:target",
    "summary": "The :target CSS pseudo-class represents a unique element (the target element) with an id matching the URL's fragment."
  },
  {
    "title": "font-stretch",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-stretch",
    "summary": "The font-stretch CSS property selects a normal, condensed, or expanded face from a font."
  },
  {
    "title": "At-rules",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/At-rule",
    "summary": "At-rules are CSS statements that instruct CSS how to behave. They begin with an at sign, '@' (U+0040 COMMERCIAL AT), followed by an identifier and includes everything up to the next semicolon, ';' (U+003B SEMICOLON), or the next CSS block, whichever comes first."
  },
  {
    "title": "<percentage>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/percentage",
    "summary": "The <percentage> CSS data type represents a percentage value. It is often used to define a size as relative to an element's parent object. Numerous properties can use percentages, such as width, height, margin, padding, and font-size."
  },
  {
    "title": "page-break-after",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/page-break-after",
    "summary": "The page-break-after CSS property adjusts page breaks after the current element."
  },
  {
    "title": "background-position-x",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-position-x",
    "summary": "The background-position-x CSS property sets the initial horizontal position for each background image. The position is relative to the position layer set by background-origin."
  },
  {
    "title": "::selection",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::selection",
    "summary": "The ::selection CSS pseudo-element applies styles to the part of a document that has been highlighted by the user (such as clicking and dragging the mouse across text)."
  },
  {
    "title": "background-origin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-origin",
    "summary": "The background-origin CSS property sets the background's origin: from the border start, inside the border, or inside the padding."
  },
  {
    "title": "font-variant",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant",
    "summary": "The font-variant CSS shorthand property allows you to set all the font variants for a font."
  },
  {
    "title": "::file-selector-button",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::file-selector-button",
    "summary": "The ::file-selector-button CSS pseudo-element represents the button of an <input> of type=\"file\"."
  },
  {
    "title": "@viewport",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@viewport",
    "summary": "The @viewport CSS at-rule lets you configure the viewport through which the document is viewed. It's primarily used for mobile devices, but is also used by desktop browsers that support features like \"snap to edge\" (such as Microsoft Edge)."
  },
  {
    "title": ":scope",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:scope",
    "summary": "The :scope CSS pseudo-class represents elements that are a reference point for selectors to match against."
  },
  {
    "title": "clip",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/clip",
    "summary": "The clip CSS property defines a visible portion of an element. The clip property applies only to absolutely positioned elements — that is, elements with position:absolute or position:fixed."
  },
  {
    "title": "url()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/url",
    "summary": "The url() CSS function is used to include a file. The parameter is an absolute URL, a relative URL, a blob URL, or a data URL. The url() function can be passed as a parameter of another CSS functions, like the attr() function. Depending on the property for which it is a value, the resource sought can be an image, font, or a stylesheet. The url() functional notation is the value for the <url> data type."
  },
  {
    "title": "animation-duration",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-duration",
    "summary": "The animation-duration CSS property sets the length of time that an animation takes to complete one cycle."
  },
  {
    "title": "perspective",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/perspective",
    "summary": "The perspective CSS property determines the distance between the z=0 plane and the user in order to give a 3D-positioned element some perspective."
  },
  {
    "title": "margin-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-inline",
    "summary": "The margin-inline CSS shorthand property is a shorthand property that defines both the logical inline start and end margins of an element, which maps to physical margins depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "Syntax",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Syntax",
    "summary": "The basic goal of the Cascading Stylesheet (CSS) language is to allow a browser engine to paint elements of the page with specific features, like colors, positioning, or decorations. The CSS syntax reflects this goal and its basic building blocks are:"
  },
  {
    "title": "offset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset",
    "summary": "The offset CSS shorthand property sets all the properties required for animating an element along a defined path."
  },
  {
    "title": "::backdrop",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::backdrop",
    "summary": "The ::backdrop CSS pseudo-element is a box the size of the viewport which is rendered immediately beneath any element being presented in fullscreen mode. This includes both elements which have been placed in fullscreen mode using the Fullscreen API and <dialog> elements."
  },
  {
    "title": "::part()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::part",
    "summary": "The ::part CSS pseudo-element represents any element within a shadow tree that has a matching part attribute."
  },
  {
    "title": "page-break-inside",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/page-break-inside",
    "summary": "The page-break-inside CSS property adjusts page breaks inside the current element."
  },
  {
    "title": "revert",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/revert",
    "summary": "The revert CSS keyword reverts the cascaded value of the property from its current value to the value the property would have had if no changes had been made by the current style origin to the current element. Thus, it resets the property to its inherited value if it inherits from its parent or to the default value established by the user agent's stylesheet (or by user styles, if any exist). It can be applied to any CSS property, including the CSS shorthand property all."
  },
  {
    "title": ":visited",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:visited",
    "summary": "The :visited CSS pseudo-class represents links that the user has already visited. For privacy reasons, the styles that can be modified using this selector are very limited."
  },
  {
    "title": "Introducing the CSS Cascade",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Cascade",
    "summary": "The cascade is an algorithm that defines how to combine property values originating from different sources. It lies at the core of CSS, as emphasized by the name: Cascading Style Sheets. This article explains what the cascade is, the order in which CSS declarations cascade, and how this affects you, the web developer."
  },
  {
    "title": "Comments",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Comments",
    "summary": "A CSS comment is used to add explanatory notes to the code or to prevent the browser from interpreting specific parts of the style sheet. By design, comments have no effect on the layout of a document."
  },
  {
    "title": "outline-offset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/outline-offset",
    "summary": "The outline-offset CSS property sets the amount of space between an outline and the edge or border of an element."
  },
  {
    "title": "all",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/all",
    "summary": "The all shorthand CSS property resets all of an element's properties except unicode-bidi, direction, and CSS Custom Properties. It can set properties to their initial or inherited values, or to the values specified in another cascade layer or stylesheet origin."
  },
  {
    "title": "column-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-width",
    "summary": "The column-width CSS property sets the ideal column width in a multi-column layout. The container will have as many columns as can fit without any of them having a width less than the column-width value. If the width of the container is narrower than the specified value, the single column's width will be smaller than the declared column width."
  },
  {
    "title": ":only-child",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:only-child",
    "summary": "The :only-child CSS pseudo-class represents an element without any siblings. This is the same as :first-child:last-child or :nth-child(1):nth-last-child(1), but with a lower specificity."
  },
  {
    "title": "grid-column-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-column-end",
    "summary": "The grid-column-end CSS property specifies a grid item's end position within the grid column by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the block-end edge of its grid area."
  },
  {
    "title": "font-variant-numeric",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-numeric",
    "summary": "The font-variant-numeric CSS property controls the usage of alternate glyphs for numbers, fractions, and ordinal markers."
  },
  {
    "title": "text-rendering",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-rendering",
    "summary": "The text-rendering CSS property provides information to the rendering engine about what to optimize for when rendering text."
  },
  {
    "title": "text-indent",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-indent",
    "summary": "The text-indent CSS property sets the length of empty space (indentation) that is put before lines of text in a block."
  },
  {
    "title": "min-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min-content",
    "summary": "The min-content sizing keyword represents the intrinsic minimum width of the content. For text content this means that the content will take all soft-wrapping opportunities, becoming as small as the longest word."
  },
  {
    "title": "var()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/var",
    "summary": "The var() CSS function can be used to insert the value of a custom property (sometimes called a \"CSS variable\") instead of any part of a value of another property."
  },
  {
    "title": "border-bottom-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom-style",
    "summary": "The border-bottom-style CSS property sets the line style of an element's bottom border."
  },
  {
    "title": "break-after",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/break-after",
    "summary": "The break-after CSS property sets how page, column, or region breaks should behave after a generated box. If there is no generated box, the property is ignored."
  },
  {
    "title": "border-left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-left",
    "summary": "The border-left shorthand CSS property sets all the properties of an element's left border."
  },
  {
    "title": "translateX()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translateX",
    "summary": "The translateX() CSS function repositions an element horizontally on the 2D plane. Its\n  result is a <transform-function> data type."
  },
  {
    "title": "padding-right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-right",
    "summary": "The padding-right CSS property sets the width of the padding area on the right of an element."
  },
  {
    "title": "text-underline-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-underline-position",
    "summary": "The text-underline-position CSS property specifies the position of the underline which is set using the text-decoration property's underline value."
  },
  {
    "title": "offset-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset-position",
    "summary": "The offset-position CSS property defines the initial position of the offset-path."
  },
  {
    "title": "attr()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/attr",
    "summary": "The attr() CSS function is used to retrieve the value of an attribute of the selected element and use it in the stylesheet. It can also be used on pseudo-elements, in which case the value of the attribute on the pseudo-element's originating element is returned."
  },
  {
    "title": "font-size-adjust",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-size-adjust",
    "summary": "The font-size-adjust CSS property sets the size of lower-case letters relative to the current font size (which defines the size of upper-case letters)."
  },
  {
    "title": "image-resolution",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image-resolution",
    "summary": "The image-resolution CSS property specifies the intrinsic resolution of all raster images used in or on the element. It affects content images such as replaced elements and generated content, and decorative images such as background-image images."
  },
  {
    "title": ":placeholder-shown",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:placeholder-shown",
    "summary": "The :placeholder-shown CSS pseudo-class represents any <input> or <textarea> element that is currently displaying placeholder text."
  },
  {
    "title": "border-right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-right",
    "summary": "The border-right shorthand CSS property sets all the properties of an element's right border."
  },
  {
    "title": "break-inside",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/break-inside",
    "summary": "The break-inside CSS property sets how page, column, or region breaks should behave inside a generated box. If there is no generated box, the property is ignored."
  },
  {
    "title": "scroll-margin-top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-top",
    "summary": "The scroll-margin-top property defines the top margin of the scroll snap area that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "scroll-padding",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding",
    "summary": "The scroll-padding shorthand property sets scroll padding on all sides of an element at once, much like the padding property does for padding on an element."
  },
  {
    "title": ":link",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:link",
    "summary": "The :link CSS pseudo-class represents an element that has not yet been visited. It matches every unvisited <a> or <area> element that has an href attribute."
  },
  {
    "title": "shape-outside",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/shape-outside",
    "summary": "The shape-outside CSS property defines a shape—which may be non-rectangular—around which adjacent inline content should wrap. By default, inline content wraps around its margin box; shape-outside provides a way to customize this wrapping, making it possible to wrap text around complex objects rather than simple boxes."
  },
  {
    "title": "grid-row-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-row-start",
    "summary": "The grid-row-start CSS property specifies a grid item's start position within the grid row by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the inline-start edge of its grid area."
  },
  {
    "title": "scrollbar-gutter",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scrollbar-gutter",
    "summary": "The scrollbar-gutter CSS property allows authors to reserve space for the scrollbar, preventing unwanted layout changes as the content grows while also avoiding unnecessary visuals when scrolling isn't needed."
  },
  {
    "title": "column-count",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-count",
    "summary": "The column-count CSS property breaks an element's content into the specified number of columns."
  },
  {
    "title": "word-spacing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/word-spacing",
    "summary": "The word-spacing CSS property sets the length of space between words and between tags."
  },
  {
    "title": "column-span",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-span",
    "summary": "The column-span CSS property makes it possible for an element to span across all columns when its value is set to all."
  },
  {
    "title": "block-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/block-size",
    "summary": "The block-size CSS property defines the horizontal or vertical size of an element's block, depending on its writing mode. It corresponds to either the width or the height property, depending on the value of writing-mode."
  },
  {
    "title": "place-content",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/place-content",
    "summary": "The place-content CSS shorthand property allows you to align content along both the block and inline directions at once (i.e. the align-content and justify-content properties) in a relevant layout system such as Grid or Flexbox."
  },
  {
    "title": ":first",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:first",
    "summary": "The :first CSS pseudo-class, used with the @page at-rule, represents the first page of a printed document. (See :first-child for general first element of a node.)"
  },
  {
    "title": "aspect-ratio",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/aspect-ratio",
    "summary": "The aspect-ratio CSS media feature can be used to test the aspect ratio of the viewport."
  },
  {
    "title": "text-justify",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-justify",
    "summary": "The text-justify CSS property sets what type of justification should be applied to text when text-align: justify; is set on an element."
  },
  {
    "title": "initial",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/initial",
    "summary": "The initial CSS keyword applies the initial (or default) value of a property to an element. It can be applied to any CSS property, including the CSS shorthand property all. With all set to initial, all CSS properties can be restored to their respective initial values in one go instead of restoring each one separately."
  },
  {
    "title": "transform-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-style",
    "summary": "The transform-style CSS property sets whether children of an element are positioned in the 3D space or are flattened in the plane of the element."
  },
  {
    "title": "font-kerning",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-kerning",
    "summary": "The font-kerning CSS property sets the use of the kerning information stored in a font."
  },
  {
    "title": "brightness()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/brightness",
    "summary": "The brightness() CSS function applies a linear multiplier to the input image, making it appear brighter or darker. Its result is a <filter-function>."
  },
  {
    "title": "border-image-slice",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image-slice",
    "summary": "The border-image-slice CSS property divides the image specified by border-image-source into regions. These regions form the components of an element's border image."
  },
  {
    "title": "outline-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/outline-style",
    "summary": "The outline-style CSS property sets the style of an element's outline. An outline is a line that is drawn around an element, outside the border."
  },
  {
    "title": ":required",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:required",
    "summary": "The :required CSS pseudo-class represents any <input>, <select>, or <textarea> element that has the required attribute set on it."
  },
  {
    "title": "backface-visibility",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/backface-visibility",
    "summary": "The backface-visibility CSS property sets whether the back face of an element is visible when turned towards the user."
  },
  {
    "title": "::first-line",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::first-line",
    "summary": "The ::first-line CSS pseudo-element applies styles to the first line of a block-level element."
  },
  {
    "title": ":read-only",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:read-only",
    "summary": "The :read-only CSS pseudo-class represents an element (such as input or textarea) that is not editable by the user."
  },
  {
    "title": "translateY()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translateY",
    "summary": "The translateY() CSS function repositions an element vertically on the 2D plane. Its result\n  is a <transform-function> data type."
  },
  {
    "title": "::slotted()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::slotted",
    "summary": "The ::slotted() CSS pseudo-element represents any element that has been placed into a slot inside an HTML template (see Using templates and slots for more information)."
  },
  {
    "title": "invert()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/invert",
    "summary": "The invert() CSS function inverts the color samples in the input image. Its result is a <filter-function>."
  },
  {
    "title": ":host",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:host",
    "summary": "The :host CSS pseudo-class selects the shadow host of the shadow DOM containing the CSS it is used inside — in other words, this allows you to select a custom element from inside its shadow DOM."
  },
  {
    "title": "border-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline",
    "summary": "The border-inline CSS property is a shorthand property for setting the individual logical inline border property values in a single place in the style sheet."
  },
  {
    "title": "font-weight",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-weight",
    "summary": "The font-weight CSS descriptor allows authors to specify font weights for the fonts specified in the @font-face rule. The font-weight property can separately be used to set how thick or thin characters in text should be displayed."
  },
  {
    "title": "content-visibility",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/content-visibility",
    "summary": "The content-visibility CSS property controls whether or not an element renders its contents at all, along with forcing a strong set of containments, allowing user agents to potentially omit large swathes of layout and rendering work until it becomes needed. Basically it enables the user agent to skip an element's rendering work (including layout and painting) until it is needed — which makes the initial page load much faster."
  },
  {
    "title": "translate3d()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translate3d",
    "summary": "The translate3d() CSS function repositions an element in 3D space. Its result is a\n  <transform-function> data type."
  },
  {
    "title": "isolation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/isolation",
    "summary": "The isolation CSS property determines whether an element must create a new stacking context."
  },
  {
    "title": "print-color-adjust",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/print-color-adjust",
    "summary": "The print-color-adjust CSS property sets what, if anything, the user agent may do to optimize the appearance of the element on the output device.\n  By default, the browser is allowed to make any adjustments to the element's appearance it determines to be necessary and prudent given the type and capabilities of the output device."
  },
  {
    "title": ":valid",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:valid",
    "summary": "The :valid CSS pseudo-class represents any <input> or other <form> element whose contents validate successfully. This allows to easily make valid fields adopt an appearance that helps the user confirm that their data is formatted properly."
  },
  {
    "title": "grayscale()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/grayscale",
    "summary": "The grayscale() CSS function converts the input image to grayscale. Its result is a <filter-function>."
  },
  {
    "title": ":default",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:default",
    "summary": "The :default CSS pseudo-class selects form elements that are the default in a group of related elements."
  },
  {
    "title": "grid-row-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/grid-row-end",
    "summary": "The grid-row-end CSS property specifies a grid item's end position within the grid row by contributing a line, a span, or nothing (automatic) to its grid placement, thereby specifying the inline-end edge of its grid area."
  },
  {
    "title": "@counter-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style",
    "summary": "The @counter-style CSS at-rule lets you define counter styles that are not part of the predefined set of styles. A @counter-style rule defines how to convert a counter value into a string representation."
  },
  {
    "title": "border-top-right-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top-right-radius",
    "summary": "The border-top-right-radius CSS property rounds the top-right corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner."
  },
  {
    "title": "image-orientation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image-orientation",
    "summary": "The image-orientation CSS property specifies a layout-independent correction to the orientation of an image."
  },
  {
    "title": "outline-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/outline-color",
    "summary": "The outline-color CSS property sets the color of an element's outline."
  },
  {
    "title": "hover",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/hover",
    "summary": "The hover CSS media feature can be used to test whether the user's primary input mechanism can hover over elements."
  },
  {
    "title": "padding-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-inline",
    "summary": "The padding-inline CSS shorthand property defines the logical inline start and end padding of an element, which maps to physical padding properties depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "inline-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inline-size",
    "summary": "The inline-size CSS property defines the horizontal or vertical size of an element's block, depending on its writing mode. It corresponds to either the width or the height property, depending on the value of writing-mode."
  },
  {
    "title": "background-position-y",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/background-position-y",
    "summary": "The background-position-y CSS property sets the initial vertical position for each background image. The position is relative to the position layer set by background-origin."
  },
  {
    "title": "font-variant-caps",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-caps",
    "summary": "The font-variant-caps CSS property controls the use of alternate glyphs for capital letters."
  },
  {
    "title": "margin-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-block-start",
    "summary": "The margin-block-start CSS property defines the logical block start margin of an element, which maps to a physical margin depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "scroll-padding-top",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-top",
    "summary": "The scroll-padding-top property defines offsets for the top of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "skew()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/skew",
    "summary": "The skew() CSS function defines a transformation that skews an element on the 2D\n  plane. Its result is a <transform-function> data type."
  },
  {
    "title": "scroll-margin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin",
    "summary": "The scroll-margin shorthand property sets all of the scroll margins of an element at once, assigning values much like the margin property does for margins of an element."
  },
  {
    "title": "<blend-mode>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/blend-mode",
    "summary": "The <blend-mode> CSS data type describes how colors should appear when elements overlap. It is used in the background-blend-mode and mix-blend-mode properties."
  },
  {
    "title": "counter-increment",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/counter-increment",
    "summary": "The counter-increment CSS property increases or decreases the value of a CSS counter by a given value."
  },
  {
    "title": "min()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min",
    "summary": "The min() CSS function lets you set the smallest (most negative) value from a list of comma-separated expressions as the value of a CSS property value. The min() function can be used anywhere a <length>, <frequency>, <angle>, <time>, <percentage>, <number>, or <integer> is allowed."
  },
  {
    "title": "break-before",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/break-before",
    "summary": "The break-before CSS property sets how page, column, or region breaks should behave before a generated box. If there is no generated box, the property is ignored."
  },
  {
    "title": "CSS.escape()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/API/CSS/escape",
    "summary": "The CSS.escape() static method returns a\n  string containing the escaped string passed as parameter, mostly for\n  use as part of a CSS selector."
  },
  {
    "title": ":nth-last-of-type()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-of-type",
    "summary": "The :nth-last-of-type() CSS pseudo-class matches elements based on their position among siblings of the same type (tag name), counting from the end."
  },
  {
    "title": "page-break-before",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/page-break-before",
    "summary": "The page-break-before CSS property adjusts page breaks before the current element."
  },
  {
    "title": "border-bottom-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom-width",
    "summary": "The border-bottom-width CSS property sets the width of the bottom border of an element."
  },
  {
    "title": "<angle>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/angle",
    "summary": "The <angle> CSS data type represents an angle value expressed in degrees, gradians, radians, or turns. It is used, for example, in <gradient>s and in some transform functions."
  },
  {
    "title": "scroll-snap-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-align",
    "summary": "The scroll-snap-align property specifies the box's snap position as an alignment of its snap area (as the alignment subject) within its snap container's snapport (as the alignment container). The two values specify the snapping alignment in the block axis and inline axis, respectively. If only one value is specified, the second value defaults to the same value."
  },
  {
    "title": ":any-link",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:any-link",
    "summary": "The :any-link CSS pseudo-class selector represents an element that acts as the source anchor of a hyperlink, independent of whether it has been visited. In other words, it matches every <a> or <area> element that has an href attribute. Thus, it matches all elements that match :link or :visited."
  },
  {
    "title": "mask-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-size",
    "summary": "The mask-size CSS property specifies the sizes of the mask images. The size of the image can be fully or partially constrained in order to preserve its intrinsic ratio."
  },
  {
    "title": "text-emphasis",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-emphasis",
    "summary": "The text-emphasis CSS property applies emphasis marks to text (except spaces and control characters). It is a shorthand for text-emphasis-style and text-emphasis-color."
  },
  {
    "title": "border-top-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top-style",
    "summary": "The border-top-style CSS property sets the line style of an element's top border."
  },
  {
    "title": "@scroll-timeline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@scroll-timeline",
    "summary": "The @scroll-timeline CSS at-rule defines an AnimationTimeline whose time values are determined by scrolling progress within a scroll container and not by minutes or seconds. Once specified, a scroll timeline is associated with a CSS Animation by using the animation-timeline property."
  },
  {
    "title": "<number>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/number",
    "summary": "The <number> CSS data type represents a number, being either an integer or a number with a fractional component."
  },
  {
    "title": "scale",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scale",
    "summary": "The scale CSS property allows you to specify scale transforms individually and independently of the transform property. This maps better to typical user interface usage, and saves having to remember the exact order of transform functions to specify in the transform value."
  },
  {
    "title": "counter-reset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/counter-reset",
    "summary": "The counter-reset CSS property resets a CSS counter to a given value.\n  This property will create a new counter or reversed counter with the given name on the specified element."
  },
  {
    "title": ":dir()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:dir",
    "summary": "The :dir() CSS pseudo-class matches elements based on the directionality of the text contained in them."
  },
  {
    "title": "@property",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@property",
    "summary": "The @property CSS at-rule is part of the CSS Houdini umbrella of APIs, it allows developers to explicitly define their css custom properties, allowing for property type checking, setting default values, and define whether a property can inherit values or not."
  },
  {
    "title": ":enabled",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:enabled",
    "summary": "The :enabled CSS pseudo-class represents any enabled element. An element is enabled if it can be activated (selected, clicked on, typed into, etc.) or accept focus. The element also has a disabled state, in which it can't be activated or accept focus."
  },
  {
    "title": "<display-box>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-box",
    "summary": "These keywords define whether an element generates display boxes at all."
  },
  {
    "title": "hyphenate-character",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/hyphenate-character",
    "summary": "The hyphenate-character CSS property sets the character (or string) used at the end of a line before a hyphenation break."
  },
  {
    "title": ":blank",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:blank",
    "summary": "The :blank CSS pseudo-class selects empty user input elements (e.g. <input> or <textarea>)."
  },
  {
    "title": ":fullscreen",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:fullscreen",
    "summary": "The :fullscreen CSS pseudo-class matches every element which is currently in fullscreen mode. If multiple elements have been put into fullscreen mode, this selects them all."
  },
  {
    "title": "margin-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-block",
    "summary": "The margin-block CSS shorthand property defines the logical block start and end margins of an element, which maps to physical margins depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "quotes",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/quotes",
    "summary": "The quotes CSS property sets how the browser should render quotation marks that are added using the open-quotes or close-quotes values of the CSS content property."
  },
  {
    "title": "text-align-last",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-align-last",
    "summary": "The text-align-last CSS property sets how the last line of a block or a line, right before a forced line break, is aligned."
  },
  {
    "title": "@charset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@charset",
    "summary": "The @charset CSS at-rule specifies the character encoding used in the style sheet. It must be the first element in the style sheet and not be preceded by any character; as it is not a nested statement, it cannot be used inside conditional group at-rules. If several @charset at-rules are defined, only the first one is used, and it cannot be used inside a style attribute on an HTML element or inside the <style> element where the character set of the HTML page is relevant."
  },
  {
    "title": "env()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/env",
    "summary": "The env() CSS function can be used to insert the value of a user agent-defined environment variable into your CSS, in a similar fashion to the var() function and custom properties. The difference is that, as well as being user-agent defined rather than user-defined, environment variables are globally scoped to a document, whereas custom properties are scoped to the element(s) on which they are declared."
  },
  {
    "title": "border-top-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top-color",
    "summary": "The border-top-color CSS property sets the color of an element's top border. It can also be set with the shorthand CSS properties border-color or border-top."
  },
  {
    "title": "<alpha-value>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/alpha-value",
    "summary": "The <alpha-value> CSS data type represents a value that can be either a <number> or a <percentage>, specifying the alpha channel or transparency of a color."
  },
  {
    "title": ":lang()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:lang",
    "summary": "The :lang() CSS pseudo-class matches elements based on the language they are determined to be in."
  },
  {
    "title": "border-image-outset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image-outset",
    "summary": "The border-image-outset CSS property sets the distance by which an element's border image is set out from its border box."
  },
  {
    "title": "border-inline-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-style",
    "summary": "The border-inline-style CSS property defines the style of the logical inline borders of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style and border-bottom-style, or border-left-style and border-right-style properties depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "overflow-anchor",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-anchor",
    "summary": "The overflow-anchor CSS property provides a way to opt out of the browser's scroll anchoring behavior, which adjusts scroll position to minimize content shifts."
  },
  {
    "title": "border-bottom-left-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom-left-radius",
    "summary": "The border-bottom-left-radius CSS property rounds the bottom-left corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner."
  },
  {
    "title": "rotate",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/rotate",
    "summary": "The rotate CSS property allows you to specify rotation transforms individually and independently of the transform property. This maps better to typical user interface usage, and saves having to remember the exact order of transform functions to specify in the transform property."
  },
  {
    "title": "border-image-source",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image-source",
    "summary": "The border-image-source CSS property sets the source image used to create an element's border image."
  },
  {
    "title": "box-decoration-break",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-decoration-break",
    "summary": "The box-decoration-break CSS property specifies how an element's fragments should be rendered when broken across multiple lines, columns, or pages."
  },
  {
    "title": "max()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max",
    "summary": "The max() CSS function lets you set the largest (most positive) value from a list of comma-separated expressions as the value of a CSS property value. The max() function can be used anywhere a <length>, <frequency>, <angle>, <time>, <percentage>, <number>, or <integer> is allowed."
  },
  {
    "title": "::target-text",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::target-text",
    "summary": "The ::target-text CSS pseudo-element represents the text that has been scrolled to if the browser supports scroll-to-text fragments. It allows authors to choose how to highlight that section of text."
  },
  {
    "title": "font-variant-ligatures",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-ligatures",
    "summary": "The font-variant-ligatures CSS property controls which ligatures and contextual forms are used in textual content of the elements it applies to. This leads to more harmonized forms in the resulting text."
  },
  {
    "title": "overflow-clip-margin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-clip-margin",
    "summary": "The overflow-clip-margin CSS property determines how far outside its bounds an element with overflow: clip may be painted before being clipped."
  },
  {
    "title": "@document",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@document",
    "summary": "The @document CSS at-rule restricts the style rules contained within it based on the URL of the document. It is designed primarily for user-defined style sheets, though it can be used on author-defined style sheets, too."
  },
  {
    "title": "padding-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-inline-start",
    "summary": "The padding-inline-start CSS property defines the logical inline start padding of an element, which maps to a physical padding depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "rotate3d()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/rotate3d",
    "summary": "The rotate3d() CSS function defines a transformation that rotates an element around a\n  fixed axis in 3D space, without deforming it. Its result is a <transform-function> data type."
  },
  {
    "title": "transform-box",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-box",
    "summary": "The transform-box CSS property defines the layout box to which the transform and transform-origin properties relate."
  },
  {
    "title": "src",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/src",
    "summary": "The src CSS descriptor of the @font-face rule specifies the resource containing font data. It is required for the @font-face rule to be valid."
  },
  {
    "title": "unicode-range",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/unicode-range",
    "summary": "The unicode-range CSS descriptor sets the specific range of characters to be used from a font defined by @font-face and made available for use on the current page. If the page doesn't use any character in this range, the font is not downloaded; if it uses at least one, the whole font is downloaded."
  },
  {
    "title": "<basic-shape>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/basic-shape",
    "summary": "The <basic-shape> CSS data type represents a shape used in the clip-path, shape-outside, and offset-path properties."
  },
  {
    "title": "border-bottom-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom-color",
    "summary": "The border-bottom-color CSS property sets the color of an element's bottom border. It can also be set with the shorthand CSS properties border-color or border-bottom."
  },
  {
    "title": "<display-listitem>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-listitem",
    "summary": "The list-item keyword causes the element to generate a ::marker pseudo-element with the content specified by its list-style properties (for example a bullet point) together with a principal box of the specified type for its own contents."
  },
  {
    "title": "margin-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-inline-start",
    "summary": "The margin-inline-start CSS property defines the logical inline start margin of an element, which maps to a physical margin depending on the element's writing mode, directionality, and text orientation. It corresponds to the margin-top, margin-right, margin-bottom, or margin-left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "::cue",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::cue",
    "summary": "The ::cue CSS pseudo-element matches WebVTT cues within a selected element. This can be used to style captions and other cues in media with VTT tracks."
  },
  {
    "title": "orphans",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/orphans",
    "summary": "The orphans CSS property sets the minimum number of lines in a block container that must be shown at the bottom of a page, region, or column."
  },
  {
    "title": "translate",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/translate",
    "summary": "The translate CSS property allows you to specify translation transforms individually and independently of the transform property. This maps better to typical user interface usage, and saves having to remember the exact order of transform functions to specify in the transform value."
  },
  {
    "title": "border-left-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-left-style",
    "summary": "The border-left-style CSS property sets the line style of an element's left border."
  },
  {
    "title": "matrix()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/matrix",
    "summary": "The matrix() CSS function defines a homogeneous 2D transformation matrix. Its result is\n  a <transform-function> data type."
  },
  {
    "title": "text-decoration-skip-ink",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-skip-ink",
    "summary": "The text-decoration-skip-ink CSS property specifies how overlines and underlines are drawn when they pass over glyph ascenders and descenders."
  },
  {
    "title": "unicode-bidi",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/unicode-bidi",
    "summary": "The unicode-bidi CSS property, together with the direction property, determines how bidirectional text in a document is handled. For example, if a block of content contains both left-to-right and right-to-left text, the user-agent uses a complex Unicode algorithm to decide how to display the text. The unicode-bidi property overrides this algorithm and allows the developer to control the text embedding."
  },
  {
    "title": "caption-side",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/caption-side",
    "summary": "The caption-side CSS property puts the content of a table's <caption> on the specified side. The values are relative to the writing-mode of the table."
  },
  {
    "title": "border-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block",
    "summary": "The border-block CSS property is a shorthand property for setting the individual logical block border property values in a single place in the style sheet."
  },
  {
    "title": "repeating-linear-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/repeating-linear-gradient",
    "summary": "The repeating-linear-gradient() CSS function creates an image consisting of repeating linear gradients. It is similar to linear-gradient() and takes the same arguments, but it repeats the color stops infinitely in all directions so as to cover its entire container. The function's result is an object of the <gradient> data type, which is a special kind of <image>."
  },
  {
    "title": "tab-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/tab-size",
    "summary": "The tab-size CSS property is used to customize the width of tab characters (U+0009)."
  },
  {
    "title": "border-top-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-top-width",
    "summary": "The border-top-width CSS property sets the width of the top border of an element."
  },
  {
    "title": "font-variant-alternates",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-alternates",
    "summary": "The font-variant-alternates CSS property controls the usage of alternate glyphs. These alternate glyphs may be referenced by alternative names defined in @font-feature-values."
  },
  {
    "title": "outline-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/outline-width",
    "summary": "The CSS outline-width property sets the thickness of an element's outline. An outline is a line that is drawn around an element, outside the border."
  },
  {
    "title": "mask-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-position",
    "summary": "The mask-position CSS property sets the initial position, relative to the mask position layer set by mask-origin, for each defined mask image."
  },
  {
    "title": "pointer",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/pointer",
    "summary": "The pointer CSS media feature tests whether the user has a pointing device (such as a mouse), and if so, how accurate the primary pointing device is."
  },
  {
    "title": ":indeterminate",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:indeterminate",
    "summary": "The :indeterminate CSS pseudo-class represents any form element whose state is indeterminate, such as checkboxes which have their HTML indeterminate attribute set to true, radio buttons which are members of a group in which all radio buttons are unchecked, and indeterminate <progress> elements."
  },
  {
    "title": "column-fill",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-fill",
    "summary": "The column-fill CSS property controls how an element's contents are balanced when broken into columns."
  },
  {
    "title": "margin-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-block-end",
    "summary": "The margin-block-end CSS property defines the logical block end margin of an element, which maps to a physical margin depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "animation-timeline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/animation-timeline",
    "summary": "The animation-timeline CSS property specifies the names of one or more @scroll-timeline at-rules describing the scroll animations to apply to the element."
  },
  {
    "title": "<string>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/string",
    "summary": "The <string> CSS data type represents a sequence of characters. Strings are used in numerous CSS properties, such as content, font-family, and quotes."
  },
  {
    "title": "border-bottom-right-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-bottom-right-radius",
    "summary": "The border-bottom-right-radius CSS property rounds the bottom-right corner of an element by specifying the radius (or the radius of the semi-major and semi-minor axes) of the ellipse defining the curvature of the corner."
  },
  {
    "title": ":defined",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:defined",
    "summary": "The :defined CSS pseudo-class represents any element that has been defined. This includes any standard element built in to the browser, and custom elements that have been successfully defined (i.e. with the CustomElementRegistry.define() method)."
  },
  {
    "title": "border-image-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image-width",
    "summary": "The border-image-width CSS property sets the width of an element's border image."
  },
  {
    "title": "font-variation-settings",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variation-settings",
    "summary": "The font-variation-settings CSS property provides low-level control over variable font characteristics, by specifying the four letter axis names of the characteristics you want to vary, along with their values."
  },
  {
    "title": "border-right-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-right-style",
    "summary": "The border-right-style CSS property sets the line style of an element's right border."
  },
  {
    "title": "<resolution>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/resolution",
    "summary": "The <resolution> CSS data type, used for describing resolutions in media queries, denotes the pixel density of an output device, i.e., its resolution."
  },
  {
    "title": "empty-cells",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/empty-cells",
    "summary": "The empty-cells CSS property sets whether borders and backgrounds appear around <table> cells that have no visible content."
  },
  {
    "title": "mask-clip",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-clip",
    "summary": "The mask-clip CSS property determines the area which is affected by a mask. The painted content of an element must be restricted to this area."
  },
  {
    "title": "::grammar-error",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::grammar-error",
    "summary": "The ::grammar-error CSS pseudo-element represents a text segment which the user agent has flagged as grammatically incorrect."
  },
  {
    "title": "box-flex",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-flex",
    "summary": "The -moz-box-flex and -webkit-box-flex CSS properties specify how a -moz-box or -webkit-box grows to fill the box that contains it, in the direction of the containing box's layout."
  },
  {
    "title": "<custom-ident>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/custom-ident",
    "summary": "The <custom-ident> CSS data type denotes an arbitrary user-defined string used as an identifier. It is case-sensitive, and certain values are forbidden in various contexts to prevent ambiguity."
  },
  {
    "title": "device-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/device-width",
    "summary": "The device-width CSS media feature can be used to test the width of an output device's rendering surface."
  },
  {
    "title": "<display-inside>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-inside",
    "summary": "These keywords specify the element's inner display type, which defines the type of formatting context that lays out its contents (assuming it is a non-replaced element). These keywords are used as values of the display property, and can be used for legacy purposes as a single keyword, or as defined in the Level 3 specification alongside a value from the <display-outside> keywords."
  },
  {
    "title": "conic-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/conic-gradient",
    "summary": "The conic-gradient() CSS function creates an image consisting of a gradient with color transitions rotated around a center point (rather than radiating from the center). Example conic gradients include pie charts and color wheels. The result of the conic-gradient() function is an object of the <gradient> data type, which is a special kind of <image>."
  },
  {
    "title": "padding-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-block",
    "summary": "The padding-block CSS shorthand property defines the logical block start and end padding of an element, which maps to physical padding properties depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "place-self",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/place-self",
    "summary": "The place-self CSS shorthand property allows you to align an individual item in both the block and inline directions at once (i.e. the align-self and justify-self properties) in a relevant layout system such as Grid or Flexbox. If the second value is not present, the first value is also used for it."
  },
  {
    "title": "scroll-snap-stop",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-stop",
    "summary": "The scroll-snap-stop CSS property defines whether the scroll container is allowed to \"pass over\" possible snap positions."
  },
  {
    "title": "@namespace",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@namespace",
    "summary": "@namespace is an at-rule that defines XML namespaces to be used in a CSS style sheet."
  },
  {
    "title": "margin-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-inline-end",
    "summary": "The margin-inline-end CSS property defines the logical inline end margin of an element, which maps to a physical margin depending on the element's writing mode, directionality, and text orientation. In other words, it corresponds to the margin-top, margin-right, margin-bottom or margin-left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "<display-outside>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-outside",
    "summary": "The <display-outside> keywords specify the element's outer display type, which is essentially its role in flow layout. These keywords are used as values of the display property, and can be used for legacy purposes as a single keyword, or as defined in the Level 3 specification alongside a value from the <display-inside> keywords."
  },
  {
    "title": "border-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-start",
    "summary": "The border-block-start CSS property is a shorthand property for setting the individual logical block-start border property values in a single place in the style sheet."
  },
  {
    "title": "border-image-repeat",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-image-repeat",
    "summary": "The border-image-repeat CSS property defines how the edge regions of a source image are adjusted to fit the dimensions of an element's border image."
  },
  {
    "title": "scroll-padding-bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-bottom",
    "summary": "The scroll-padding-bottom property defines offsets for the bottom of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "column-rule",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-rule",
    "summary": "The column-rule shorthand CSS property sets the width, style, and color of the line drawn between columns in a multi-column layout."
  },
  {
    "title": "perspective-origin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/perspective-origin",
    "summary": "The perspective-origin CSS property determines the position at which the viewer is looking. It is used as the vanishing point by the perspective property."
  },
  {
    "title": "border-block-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-color",
    "summary": "The border-block-color CSS property defines the color of the logical block borders of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color and border-bottom-color, or border-right-color and border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "border-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-end",
    "summary": "The border-block-end CSS property is a shorthand property for setting the individual logical block-end border property values in a single place in the style sheet."
  },
  {
    "title": "mask-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-mode",
    "summary": "The mask-mode CSS property sets whether the mask reference defined by mask-image is treated as a luminance or alpha mask."
  },
  {
    "title": "ime-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/ime-mode",
    "summary": "The ime-mode CSS property controls the state of the input method editor (IME) for text fields. This property is obsolete."
  },
  {
    "title": "resolution",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/resolution",
    "summary": "The resolution CSS media feature can be used to test the pixel density of the output device."
  },
  {
    "title": "height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/height",
    "summary": "The height CSS media feature can be used to apply styles based on the height of the viewport (or the page box, for paged media)."
  },
  {
    "title": "widows",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/widows",
    "summary": "The widows CSS property sets the minimum number of lines in a block container that must be shown at the top of a page, region, or column."
  },
  {
    "title": "overflow-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-inline",
    "summary": "The overflow-inline CSS property sets what shows when content overflows the inline start and end edges of a box. This may be nothing, a scroll bar, or the overflow content."
  },
  {
    "title": "hue-rotate()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/hue-rotate",
    "summary": "The hue-rotate() CSS function rotates the hue of an element and its contents. Its result is a <filter-function>."
  },
  {
    "title": "<length-percentage>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/length-percentage",
    "summary": "The <length-percentage> CSS data type represents a value that can be either a <length> or a <percentage>."
  },
  {
    "title": "box-orient",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-orient",
    "summary": "The box-orient CSS property sets whether an element lays out its contents horizontally or vertically."
  },
  {
    "title": "text-combine-upright",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-combine-upright",
    "summary": "The text-combine-upright CSS property sets the combination of characters into the space of a single character. If the combined text is wider than 1em, the user agent must fit the contents within 1em. The resulting composition is treated as a single upright glyph for layout and decoration. This property only has an effect in vertical writing modes."
  },
  {
    "title": "border-left-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-left-width",
    "summary": "The border-left-width CSS property sets the width of the left border of an element."
  },
  {
    "title": "offset-anchor",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset-anchor",
    "summary": "The offset-anchor CSS property specifies the point inside the box of an element traveling along an offset-path that is actually moving along the path."
  },
  {
    "title": ":only-of-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:only-of-type",
    "summary": "The :only-of-type CSS pseudo-class represents an element that has no siblings of the same type."
  },
  {
    "title": "font-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-style",
    "summary": "The font-style CSS descriptor allows authors to specify font styles for the fonts specified in the @font-face rule."
  },
  {
    "title": "border-left-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-left-color",
    "summary": "The border-left-color CSS property sets the color of an element's left border. It can also be set with the shorthand CSS properties border-color or border-left."
  },
  {
    "title": "mask-composite",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-composite",
    "summary": "The mask-composite CSS property represents a compositing operation used on the current mask layer with the mask layers below it."
  },
  {
    "title": "padding-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-inline-end",
    "summary": "The padding-inline-end CSS property defines the logical inline end padding of an element, which maps to a physical padding depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": "box-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-align",
    "summary": "The box-align CSS property specifies how an element aligns its contents across its layout in a perpendicular direction. The effect of the property is only visible if there is extra space in the box."
  },
  {
    "title": "polygon()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/basic-shape/polygon",
    "summary": "The polygon() CSS function is one of the <basic-shape> data types."
  },
  {
    "title": ":in-range",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:in-range",
    "summary": "The :in-range CSS pseudo-class represents an <input> element whose current value is within the range limits specified by the min and max attributes."
  },
  {
    "title": "forced-colors",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/forced-colors",
    "summary": "The forced-colors CSS media feature is used to detect if the user agent has enabled a forced colors mode where it enforces a user-chosen limited color palette on the page. An example of a forced colors mode is Windows High Contrast mode."
  },
  {
    "title": "<dimension>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/dimension",
    "summary": "The <dimension> CSS data type represents a <number> with a unit attached to it, for example 10px."
  },
  {
    "title": "<integer>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/integer",
    "summary": "The <integer> CSS data type is a special type of <number> that represents a whole number, whether positive or negative. Integers can be used in numerous CSS properties, such as column-count, counter-increment, grid-column, grid-row, and z-index."
  },
  {
    "title": "offset-path",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset-path",
    "summary": "The offset-path CSS property specifies a motion path for an element to follow and defines the element's positioning within the parent container or SVG coordinate system."
  },
  {
    "title": "counter-set",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/counter-set",
    "summary": "The counter-set CSS property sets a CSS counter to a given value. It manipulates the value of existing counters, and will only create new counters if there isn't already a counter of the given name on the element."
  },
  {
    "title": "font-synthesis",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-synthesis",
    "summary": "The font-synthesis CSS property controls which missing typefaces, bold, italic, or small-caps, may be synthesized by the browser."
  },
  {
    "title": "border-block-end-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-end-style",
    "summary": "The border-block-end-style CSS property defines the style of the logical block-end border of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style, border-right-style, border-bottom-style, or border-left-style property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "initial-letter",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/initial-letter",
    "summary": "The initial-letter CSS property sets styling for dropped, raised, and sunken initial letters."
  },
  {
    "title": "mask-repeat",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-repeat",
    "summary": "The mask-repeat CSS property sets how mask images are repeated. A mask image can be repeated along the horizontal axis, the vertical axis, both axes, or not repeated at all."
  },
  {
    "title": "max-inline-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max-inline-size",
    "summary": "The max-inline-size CSS property defines the horizontal or vertical maximum size of an element's block, depending on its writing mode. It corresponds to either the max-width or the max-height property, depending on the value of writing-mode."
  },
  {
    "title": "image-set()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image/image-set",
    "summary": "The image-set() CSS functional notation is a method of letting the browser pick the most appropriate CSS image from a given set, primarily for high pixel density screens."
  },
  {
    "title": "border-end-end-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-end-end-radius",
    "summary": "The border-end-end-radius CSS property defines a logical border radius on an element, which maps to a physical border radius that depends on the element's writing-mode, direction, and text-orientation. This is useful when building styles to work regardless of the text orientation and writing mode."
  },
  {
    "title": "<time>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/time",
    "summary": "The <time> CSS data type represents a time value expressed in seconds or milliseconds. It is used in animation, transition, and related properties."
  },
  {
    "title": "forced-color-adjust",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/forced-color-adjust",
    "summary": "The forced-color-adjust CSS property allows authors to opt certain elements out of forced colors mode. This then restores the control of those values to CSS."
  },
  {
    "title": "border-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-end",
    "summary": "The border-inline-end CSS property is a shorthand property for setting the individual logical inline-end border property values in a single place in the style sheet."
  },
  {
    "title": "offset-distance",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset-distance",
    "summary": "The offset-distance CSS property specifies a position along an offset-path for an element to be placed."
  },
  {
    "title": "text-emphasis-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-emphasis-color",
    "summary": "The text-emphasis-color CSS property sets the color of emphasis marks. This value can also be set using the text-emphasis shorthand."
  },
  {
    "title": ":optional",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:optional",
    "summary": "The :optional CSS pseudo-class represents any <input>, <select>, or <textarea> element that does not have the required attribute set on it."
  },
  {
    "title": "border-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-start",
    "summary": "The border-inline-start CSS property is a shorthand property for setting the individual logical inline-start border property values in a single place in the style sheet."
  },
  {
    "title": "border-right-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-right-color",
    "summary": "The border-right-color CSS property sets the color of an element's right border. It can also be set with the shorthand CSS properties border-color or border-right."
  },
  {
    "title": "overscroll-behavior-y",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overscroll-behavior-y",
    "summary": "The overscroll-behavior-y CSS property sets the browser's behavior when the vertical boundary of a scrolling area is reached."
  },
  {
    "title": "text-decoration-skip",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-decoration-skip",
    "summary": "The text-decoration-skip CSS property sets what parts of an element's content any text decoration affecting the element must skip over. It controls all text decoration lines drawn by the element and also any text decoration lines drawn by its ancestors."
  },
  {
    "title": "display-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/display-mode",
    "summary": "The display-mode CSS media feature can be used to test the display mode of an application. You can use it to provide a consistent user experience between launching a site from a URL and launching it from a desktop icon."
  },
  {
    "title": "::spelling-error",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::spelling-error",
    "summary": "The ::spelling-error CSS pseudo-element represents a text segment which the user agent has flagged as incorrectly spelled."
  },
  {
    "title": "border-inline-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-color",
    "summary": "The border-inline-color CSS property defines the color of the logical inline borders of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color and border-bottom-color, or border-right-color and border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "saturate()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/saturate",
    "summary": "The saturate() CSS function super-saturates or desaturates the input image. Its result is a <filter-function>."
  },
  {
    "title": "mask-border",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border",
    "summary": "The mask-border CSS shorthand property lets you create a mask along the edge of an element's border."
  },
  {
    "title": "offset-rotate",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/offset-rotate",
    "summary": "The offset-rotate CSS property defines the orientation/direction of the element as it is positioned along the offset-path."
  },
  {
    "title": "overflow-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-block",
    "summary": "The overflow-block CSS property sets what shows when content overflows the block start and block end edges of a box. This may be nothing, a scroll bar, or the overflow content."
  },
  {
    "title": ":out-of-range",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:out-of-range",
    "summary": "The :out-of-range CSS pseudo-class represents an <input> element whose current value is outside the range limits specified by the min and max attributes."
  },
  {
    "title": "border-right-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-right-width",
    "summary": "The border-right-width CSS property sets the width of the right border of an element."
  },
  {
    "title": "font-optical-sizing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-optical-sizing",
    "summary": "The font-optical-sizing CSS property sets whether text rendering is optimized for viewing at different sizes."
  },
  {
    "title": "font-variant-east-asian",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-east-asian",
    "summary": "The font-variant-east-asian CSS property controls the use of alternate glyphs for East Asian scripts, like Japanese and Chinese."
  },
  {
    "title": "font-variant-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-variant-position",
    "summary": "The font-variant-position CSS property controls the use of alternate, smaller glyphs that are positioned as superscript or subscript."
  },
  {
    "title": "@color-profile",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@color-profile",
    "summary": "The @color-profile CSS at-rule defines and names a color profile which can later be used in the color() function to specify a color."
  },
  {
    "title": "-ms-high-contrast",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/-ms-high-contrast",
    "summary": "The -ms-high-contrast CSS media feature is a Microsoft extension that describes whether the application is being displayed in high contrast mode, and with what color variation."
  },
  {
    "title": "border-block-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-style",
    "summary": "The border-block-style CSS property defines the style of the logical block borders of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style and border-bottom-style, or border-left-style and border-right-style properties depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "ident",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/ident",
    "summary": "The <ident> CSS data type denotes an arbitrary string used as an identifier."
  },
  {
    "title": "mask-type",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-type",
    "summary": "The mask-type CSS property sets whether an SVG <mask> element is used as a luminance or an alpha mask. It applies to the <mask> element itself."
  },
  {
    "title": "margin-trim",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/margin-trim",
    "summary": "The margin-trim property allows the container to trim the margins of its children where they adjoin the container's edges."
  },
  {
    "title": "::cue-region",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/::cue-region",
    "summary": "The ::cue-region CSS pseudo-element matches WebVTT cues within a selected element. This can be used to style captions and other cues in media with VTT tracks."
  },
  {
    "title": "column-rule-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-rule-color",
    "summary": "The column-rule-color CSS property sets the color of the line drawn between columns in a multi-column layout."
  },
  {
    "title": "translateZ()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/translateZ",
    "summary": "The translateZ() CSS function repositions an element along the z-axis in 3D space, i.e.,\n  closer to or farther away from the viewer. Its result is a <transform-function> data type."
  },
  {
    "title": "border-block-start-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-start-color",
    "summary": "The border-block-start-color CSS property defines the color of the logical block-start border of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color, border-right-color, border-bottom-color, or border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "padding-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-block-end",
    "summary": "The padding-block-end CSS property defines the logical block end padding of an element, which maps to a physical padding depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": ":left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:left",
    "summary": "The :left CSS pseudo-class, used with the @page at-rule, represents all left-hand pages of a printed document."
  },
  {
    "title": "border-block-end-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-end-color",
    "summary": "The border-block-end-color CSS property defines the color of the logical block-end border of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color, border-right-color, border-bottom-color, or border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "line-height-step",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/line-height-step",
    "summary": "The line-height-step CSS property sets the step unit for line box heights. When the property is set, line box heights are rounded up to the closest multiple of the unit."
  },
  {
    "title": "max-block-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/max-block-size",
    "summary": "The max-block-size CSS property specifies the maximum size of an element in the direction opposite that of the writing direction as specified by writing-mode. That is, if the writing direction is horizontal, then max-block-size is equivalent to max-height; if the writing direction is vertical, max-block-size is the same as max-width."
  },
  {
    "title": "overscroll-behavior-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overscroll-behavior-block",
    "summary": "The overscroll-behavior-block CSS property sets the browser's behavior when the block direction boundary of a scrolling area is reached."
  },
  {
    "title": "@font-feature-values",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-feature-values",
    "summary": "The @font-feature-values CSS at-rule lets you use a common name in the font-variant-alternates property for features activated differently in OpenType. This can help simplify your CSS when using multiple fonts."
  },
  {
    "title": "hanging-punctuation",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/hanging-punctuation",
    "summary": "The hanging-punctuation CSS property specifies whether a punctuation mark should hang at the start or end of a line of text. Hanging punctuation may be placed outside the line box."
  },
  {
    "title": "any-hover",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/any-hover",
    "summary": "The any-hover CSS media feature can be used to test whether any available input mechanism can hover over elements."
  },
  {
    "title": "border-block-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-width",
    "summary": "The border-block-width CSS property defines the width of the logical block borders of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width and border-bottom-width, or border-left-width, and border-right-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "inset-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-inline-start",
    "summary": "The inset-inline-start CSS property defines the logical inline start inset of an element, which maps to a physical offset depending on the element's writing mode, directionality, and text orientation. It corresponds to the top, right, bottom, or left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "padding-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/padding-block-start",
    "summary": "The padding-block-start CSS property defines the logical block start padding of an element, which maps to a physical padding depending on the element's writing mode, directionality, and text orientation."
  },
  {
    "title": ":paused",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:paused",
    "summary": "The :paused CSS pseudo-class selector is a resource state pseudo-class that will match an audio, video, or similar resource that is capable of being \"played\" or \"paused\", when that element is \"paused\"."
  },
  {
    "title": "border-start-start-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-start-start-radius",
    "summary": "The border-start-start-radius CSS property defines a logical border radius on an element, which maps to a physical border radius that depends on the element's writing-mode, direction, and text-orientation. This is useful when building styles to work regardless of the text orientation and writing mode."
  },
  {
    "title": "min-inline-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min-inline-size",
    "summary": "The min-inline-size CSS property defines the horizontal or vertical minimal size of an element's block, depending on its writing mode. It corresponds to either the min-width or the min-height property, depending on the value of writing-mode."
  },
  {
    "title": "ruby-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/ruby-align",
    "summary": "The ruby-align CSS property defines the distribution of the different ruby elements over the base."
  },
  {
    "title": "border-block-end-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-end-width",
    "summary": "The border-block-end-width CSS property defines the width of the logical block-end border of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width, border-right-width, border-bottom-width, or border-left-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "border-start-end-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-start-end-radius",
    "summary": "The border-start-end-radius CSS property defines a logical border radius on an element, which maps to a physical border radius depending on the element's writing-mode, direction, and text-orientation. This is useful when building styles to work regardless of the text orientation and writing mode."
  },
  {
    "title": "font-language-override",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/font-language-override",
    "summary": "The font-language-override CSS property controls the use of language-specific glyphs in a typeface."
  },
  {
    "title": "<frequency>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/frequency",
    "summary": "The <frequency> CSS data type represents a frequency dimension, such as the pitch of a speaking voice. It is not currently used in any CSS properties."
  },
  {
    "title": "ruby-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/ruby-position",
    "summary": "The ruby-position CSS property defines the position of a ruby element relatives to its base element. It can be positioned over the element (over), under it (under), or between the characters on their right side (inter-character)."
  },
  {
    "title": ":picture-in-picture",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:picture-in-picture",
    "summary": "The :picture-in-picture CSS pseudo-class matches the element which is currently in picture-in-picture mode."
  },
  {
    "title": ":nth-col",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-col",
    "summary": "The :nth-col() CSS pseudo-class is designed for tables and grids. It accepts the An+B notation such as used with the :nth-child selector, using this to target every nth column. The values odd and even are also valid."
  },
  {
    "title": "border-block-start-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-start-style",
    "summary": "The border-block-start-style CSS property defines the style of the logical block start border of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style, border-right-style, border-bottom-style, or border-left-style property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "contrast()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/contrast",
    "summary": "The contrast() CSS function adjusts the contrast of the input image. Its result is a <filter-function>."
  },
  {
    "title": "shape-margin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/shape-margin",
    "summary": "The shape-margin CSS property sets a margin for a CSS shape created using shape-outside."
  },
  {
    "title": "inset-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-block",
    "summary": "The inset-block CSS property defines the logical block start and end offsets of an element, which maps to physical offsets depending on the element's writing mode, directionality, and text orientation. It corresponds to the top and bottom, or right and left properties depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "inset-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-inline",
    "summary": "The inset-inline CSS property defines the logical start and end offsets of an element in the inline direction, which maps to physical offsets depending on the element's writing mode, directionality, and text orientation. It corresponds to the top and bottom, or right and left properties depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "scroll-margin-bottom",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-bottom",
    "summary": "The scroll-margin-bottom property defines the bottom margin of the scroll snap area that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "scroll-padding-left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-left",
    "summary": "The scroll-padding-left property defines offsets for the left of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": ":right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:right",
    "summary": "The :right CSS pseudo-class, used with the @page at-rule, represents all right-hand pages of a printed document."
  },
  {
    "title": "border-block-start-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-block-start-width",
    "summary": "The border-block-start-width CSS property defines the width of the logical block-start border of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width, border-right-width, border-bottom-width, or border-left-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "overscroll-behavior-x",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overscroll-behavior-x",
    "summary": "The overscroll-behavior-x CSS property sets the browser's behavior when the horizontal boundary of a scrolling area is reached."
  },
  {
    "title": "scroll-margin-left",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-left",
    "summary": "The scroll-margin-left property defines the left margin of the scroll snap area that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/width",
    "summary": "The width CSS media feature can be used to test the width of the viewport (or the page box, for paged media)."
  },
  {
    "title": "border-inline-end-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-end-width",
    "summary": "The border-inline-end-width CSS property defines the width of the logical inline-end border of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width, border-right-width, border-bottom-width, or border-left-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "column-rule-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-rule-style",
    "summary": "The column-rule-style CSS property sets the style of the line drawn between columns in a multi-column layout."
  },
  {
    "title": "column-rule-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/column-rule-width",
    "summary": "The column-rule-width CSS property sets the width of the line drawn between columns in a multi-column layout."
  },
  {
    "title": "inset-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-block-start",
    "summary": "The inset-block-start CSS property defines the logical block start offset of an element, which maps to a physical inset depending on the element's writing mode, directionality, and text orientation. It corresponds to the top, right, bottom, or left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "mask-origin",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-origin",
    "summary": "The mask-origin CSS property sets the origin of a mask."
  },
  {
    "title": "inset-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-block-end",
    "summary": "The inset-block-end CSS property defines the logical block end offset of an element, which maps to a physical inset depending on the element's writing mode, directionality, and text orientation. It corresponds to the top, right, bottom, or left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "scroll-margin-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-inline-start",
    "summary": "The scroll-margin-inline-start property defines the margin of the scroll snap area at the start of the inline dimension that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "border-inline-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-width",
    "summary": "The border-inline-width CSS property defines the width of the logical inline borders of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width and border-bottom-width, or border-left-width, and border-right-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "scroll-margin-right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-right",
    "summary": "The scroll-margin-right property defines the right margin of the scroll snap area that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "perspective()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/perspective",
    "summary": "The perspective() CSS function defines a transformation that sets the distance between the\n  user and the z=0 plane, the perspective from which the viewer would be if the 2-dimensional interface were\n  3-dimensional. Its result is a <transform-function> data type."
  },
  {
    "title": "CSS.supports()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/API/CSS/supports",
    "summary": "The CSS.supports() method returns a boolean value\n  indicating if the browser supports a given CSS feature, or not."
  },
  {
    "title": "size-adjust",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/size-adjust",
    "summary": "The size-adjust CSS descriptor defines a multiplier for glyph outlines and metrics associated with this font. This makes it easier to harmonize the designs of various fonts when rendered at the same font size."
  },
  {
    "title": "border-end-start-radius",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-end-start-radius",
    "summary": "The border-end-start-radius CSS property defines a logical border radius on an element, which maps to a physical border radius depending on the element's writing-mode, direction, and text-orientation. This is useful when building styles to work regardless of the text orientation and writing mode."
  },
  {
    "title": "shape-image-threshold",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/shape-image-threshold",
    "summary": "The shape-image-threshold CSS property sets the alpha channel threshold used to extract the shape using an image as the value for shape-outside."
  },
  {
    "title": "border-inline-start-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-start-color",
    "summary": "The border-inline-start-color CSS property defines the color of the logical inline start border of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color, border-right-color, border-bottom-color, or border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "<display-legacy>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-legacy",
    "summary": "CSS 2 used a single-keyword syntax for the display property, requiring separate keywords for block-level and inline-level variants of the same layout mode. This page details those values."
  },
  {
    "title": "inset-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/inset-inline-end",
    "summary": "The inset-inline-end CSS property defines the logical inline end inset of an element, which maps to a physical offset depending on the element's writing mode, directionality, and text orientation. It corresponds to the top, right, bottom, or left property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "min-block-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/min-block-size",
    "summary": "The min-block-size CSS property defines the minimum horizontal or vertical size of an element's block, depending on its writing mode. It corresponds to either the min-width or the min-height property, depending on the value of writing-mode."
  },
  {
    "title": "<ratio>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/ratio",
    "summary": "The <ratio> CSS data type, used for describing aspect ratios in media queries, denotes the proportion between two unitless values."
  },
  {
    "title": "border-inline-end-color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-end-color",
    "summary": "The border-inline-end-color CSS property defines the color of the logical inline-end border of an element, which maps to a physical border color depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-color, border-right-color, border-bottom-color, or border-left-color property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "initial-letter-align",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/initial-letter-align",
    "summary": "The initial-letter-align CSS property specifies the alignment of initial letters within a paragraph."
  },
  {
    "title": "text-emphasis-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-emphasis-style",
    "summary": "The text-emphasis-style CSS property sets the appearance of emphasis marks. It can also be set, and reset, using the text-emphasis shorthand."
  },
  {
    "title": ":read-write",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:read-write",
    "summary": "The :read-write CSS pseudo-class represents an element (such as input or textarea) that is editable by the user."
  },
  {
    "title": "border-inline-end-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-end-style",
    "summary": "The border-inline-end-style CSS property defines the style of the logical inline end border of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style, border-right-style, border-bottom-style, or border-left-style property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "border-inline-start-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-start-style",
    "summary": "The border-inline-start-style CSS property defines the style of the logical inline start border of an element, which maps to a physical border style depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-style, border-right-style, border-bottom-style, or border-left-style property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "counter()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/counter",
    "summary": "The counter() CSS function returns a string representing the current value of the named counter, if there is one.\n  It is generally used in the content property of pseudo-elements, but can theoretically be used anywhere a <string> value is supported."
  },
  {
    "title": "element()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/element",
    "summary": "The element() CSS function defines an <image> value generated from an arbitrary HTML element. This image is live, meaning that if the HTML element is changed, the CSS properties using the resulting value are automatically updated."
  },
  {
    "title": "fallback",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/fallback",
    "summary": "The fallback descriptor can be used to specify a counter style to fall back to if the current counter style cannot create a marker representation for a particular counter value."
  },
  {
    "title": "font-stretch",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-stretch",
    "summary": "The font-stretch CSS descriptor allows authors to specify a normal, condensed, or expanded face for the fonts specified in the @font-face rule."
  },
  {
    "title": ":user-invalid",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:user-invalid",
    "summary": "The :user-invalid CSS pseudo-class represents any validated form element whose value isn't valid based on their validation constraints, after the user has interacted with it."
  },
  {
    "title": "border-inline-start-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/border-inline-start-width",
    "summary": "The border-inline-start-width CSS property defines the width of the logical inline-start border of an element, which maps to a physical border width depending on the element's writing mode, directionality, and text orientation. It corresponds to the border-top-width, border-right-width, border-bottom-width, or border-left-width property depending on the values defined for writing-mode, direction, and text-orientation."
  },
  {
    "title": "text-emphasis-position",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/text-emphasis-position",
    "summary": "The text-emphasis-position CSS property sets where emphasis marks are drawn. Like ruby text, if there isn't enough room for emphasis marks, the line height is increased."
  },
  {
    "title": "<shape>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/shape",
    "summary": "The <shape> CSS data type defines the specific form (shape) of a region. The region represents the part of an element to which the clip property applies."
  },
  {
    "title": ":playing",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:playing",
    "summary": "The :playing CSS pseudo-class selector is a resource state pseudo-class that will match an audio, video, or similar resource that is capable of being \"played\" or \"paused\", when that element is \"playing\"."
  },
  {
    "title": "<display-internal>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/display-internal",
    "summary": "Some layout models such as table and ruby have a complex internal structure, with several different roles that their children and descendants can fill. This page defines those \"internal\" display values, which only have meaning within that particular layout mode."
  },
  {
    "title": ":target-within",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:target-within",
    "summary": "The :target-within CSS pseudo-class represents an element that is a target element or contains an element that is a target. A target element is a unique element with an id matching the URL's fragment. In other words, it represents an element that is itself matched by the :target pseudo-class or has a descendant that is matched by :target. (This includes descendants in shadow trees.)"
  },
  {
    "title": "font-family",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-family",
    "summary": "The font-family CSS descriptor allows authors to specify the font family for the font specified in an @font-face rule."
  },
  {
    "title": "scroll-snap-points-y",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-points-y",
    "summary": "The scroll-snap-points-y CSS property defines the vertical positioning of snap points within the content of the scroll container they are applied to."
  },
  {
    "title": "path()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/path",
    "summary": "The path() CSS function accepts an SVG path string, and is used in CSS Shapes and CSS Motion Path to enable a shape to be drawn."
  },
  {
    "title": "scale3d()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scale3d",
    "summary": "The scale3d() CSS function defines a transformation that resizes an element in 3D space.\n  Because the amount of scaling is defined by a vector, it can resize different dimensions at different scales. Its\n  result is a <transform-function> data type."
  },
  {
    "title": "prefers-contrast",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-contrast",
    "summary": "The prefers-contrast CSS media feature is used to detect if the user has requested that the web content is presented with a higher (or lower) contrast."
  },
  {
    "title": "mask-border-source",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-source",
    "summary": "The mask-border-source CSS property sets the source image used to create an element's mask border."
  },
  {
    "title": "matrix3d()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/matrix3d",
    "summary": "The matrix3d() CSS function defines a 3D transformation as a 4x4 homogeneous matrix.\n  Its result is a <transform-function> data type."
  },
  {
    "title": "cross-fade()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/cross-fade",
    "summary": "The cross-fade() CSS function can be used to blend two or more images at a defined transparency.\n  It can be used for many simple image manipulations, such as tinting an image with a solid color or highlighting a particular area of the page by combining an image with a radial gradient."
  },
  {
    "title": "<frequency-percentage>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/frequency-percentage",
    "summary": "The <frequency-percentage> CSS data type represents a value that can be either a <frequency> or a <percentage>. Frequency values, e.g. the pitch of a speaking voice, are not currently used in any CSS properties."
  },
  {
    "title": "image()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image/image",
    "summary": "The image() CSS function defines an <image> in a similar fashion to the url() function, but with added functionality including specifying the image's directionality, displaying just a part of that image defined by a media fragment, and specifying a solid color as a fallback in case none of the specified images are able to be rendered."
  },
  {
    "title": "overscroll-behavior-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/overscroll-behavior-inline",
    "summary": "The overscroll-behavior-inline CSS property sets the browser's behavior when the inline direction boundary of a scrolling area is reached."
  },
  {
    "title": "scroll-padding-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-block-start",
    "summary": "The scroll-padding-block-start property defines offsets for the start edge in the block dimension of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "mask-border-slice",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-slice",
    "summary": "The mask-border-slice CSS property divides the image set by mask-border-source into regions. These regions are used to form the components of an element's mask border."
  },
  {
    "title": "mask-border-outset",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-outset",
    "summary": "The mask-border-outset CSS property specifies the distance by which an element's mask border is set out from its border box."
  },
  {
    "title": "scroll-margin-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-inline",
    "summary": "The scroll-margin-inline shorthand property sets the scroll margins of an element in the inline dimension."
  },
  {
    "title": "scroll-snap-destination",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-destination",
    "summary": "The scroll-snap-destination CSS property defines the position in x and y coordinates within the scroll container's visual viewport which element snap points align with."
  },
  {
    "title": "scaleX()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scaleX",
    "summary": "The scaleX() CSS function defines a transformation that resizes an element along the\n  x-axis (horizontally). Its result is a <transform-function> data type."
  },
  {
    "title": "scroll-padding-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-inline",
    "summary": "The scroll-padding-inline shorthand property sets the scroll padding of an element in the inline dimension."
  },
  {
    "title": "symbols",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/symbols",
    "summary": "The symbols CSS descriptor is used to specify the symbols that the specified counter system will use to construct counter representations."
  },
  {
    "title": "<angle-percentage>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/angle-percentage",
    "summary": "The <angle-percentage> CSS data type represents a value that can be either a <angle> or a <percentage>."
  },
  {
    "title": "circle()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/basic-shape/circle",
    "summary": "The circle() CSS function is one of the <basic-shape> data types."
  },
  {
    "title": "scroll-padding-inline-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-inline-start",
    "summary": "The scroll-padding-inline-start property defines offsets for the start edge in the inline dimension of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "scroll-padding-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-block-end",
    "summary": "The scroll-padding-block-end property defines offsets for the end edge in the block dimension of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": ":user-valid",
    "url": "https://developer.mozilla.org/en-US/docs/web/css/:user-valid",
    "summary": "The :user-valid CSS pseudo-class represents any validated form element whose value validates correctly based on its validation constraints. However, unlike :valid it only matches once the user has interacted with it."
  },
  {
    "title": "mask-border-mode",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-mode",
    "summary": "The mask-border-mode CSS property specifies the blending mode used in a mask border."
  },
  {
    "title": "scroll-snap-coordinate",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-coordinate",
    "summary": "The scroll-snap-coordinate CSS property defines the x and y coordinate positions within an element that will align with its nearest ancestor scroll container's scroll-snap-destination for each respective axis."
  },
  {
    "title": "scroll-snap-points-x",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-points-x",
    "summary": "The scroll-snap-points-x CSS property defines the horizontal positioning of snap points within the content of the scroll container they are applied to."
  },
  {
    "title": "<translation-value>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/translation-value",
    "summary": "The <translation-value> CSS data type is used in the arguments for certain transform functions, including translate(), translateX(), translateY(), and translate3d()."
  },
  {
    "title": "device-height",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/device-height",
    "summary": "The device-height CSS media feature can be used to test the height of an output device's rendering surface."
  },
  {
    "title": "mask-border-width",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-width",
    "summary": "The mask-border-width CSS property sets the width of an element's mask border."
  },
  {
    "title": "masonry-auto-flow",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/masonry-auto-flow",
    "summary": "The masonry-auto-flow CSS property modifies how items are placed when using masonry in CSS Grid Layout."
  },
  {
    "title": "rotateY()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/rotateY",
    "summary": "The rotateY() CSS function defines a transformation that rotates an element around the\n  ordinate (vertical axis) without deforming it. Its result is a <transform-function> data type."
  },
  {
    "title": "scroll-padding-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-inline-end",
    "summary": "The scroll-padding-inline-end property defines offsets for the end edge in the inline dimension of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "font-variant",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-variant",
    "summary": "The font-variant CSS shorthand property allows you to set all the font variants for the fonts specified in the @font-face rule."
  },
  {
    "title": "any-pointer",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/any-pointer",
    "summary": "The any-pointer CSS media feature tests whether the user has any pointing device (such as a mouse), and if so, how accurate it is."
  },
  {
    "title": "color-gamut",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/color-gamut",
    "summary": "The color-gamut CSS media feature can be used to test the approximate range of colors that are supported by the user agent and the output device."
  },
  {
    "title": "scroll-padding-right",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-right",
    "summary": "The scroll-padding-right property defines offsets for the right of the optimal viewing region of the scrollport: the region used as the target region for placing things in view of the user. This allows the author to exclude regions of the scrollport that are obscured by other content (such as fixed-positioned toolbars or sidebars) or to put more breathing room between a targeted element and the edges of the scrollport."
  },
  {
    "title": "rotateX()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/rotateX",
    "summary": "The rotateX() CSS function defines a transformation that rotates an element around the\n  abscissa (horizontal axis) without deforming it. Its result is a <transform-function> data type."
  },
  {
    "title": "prefix",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/prefix",
    "summary": "The prefix descriptor of the @counter-style rule specifies content that will be prepended to the marker representation. If not specified, the default value will be \"\" (an empty string)."
  },
  {
    "title": "mask-border-repeat",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/mask-border-repeat",
    "summary": "The mask-border-repeat CSS property sets how the edge regions of a source image are adjusted to fit the dimensions of an element's mask border."
  },
  {
    "title": "<time-percentage>",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/time-percentage",
    "summary": "The <time-percentage> CSS data type represents a value that can be either a <time> or a <percentage>."
  },
  {
    "title": "sepia()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/sepia",
    "summary": "The sepia() CSS function converts the input image to sepia, giving it a warmer, more yellow/brown appearance. Its result is a <filter-function>."
  },
  {
    "title": "align-tracks",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/align-tracks",
    "summary": "The align-tracks CSS property sets the alignment in the masonry axis for grid containers that have masonry in their block axis."
  },
  {
    "title": "opacity()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/filter-function/opacity",
    "summary": "The opacity() CSS function applies transparency to the samples in the input image. Its result is a <filter-function>."
  },
  {
    "title": ":local-link",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:local-link",
    "summary": "The :local-link CSS pseudo-class represents a link to the same document. Therefore an element that is the source anchor of a hyperlink whose target's absolute URL matches the element's own document URL."
  },
  {
    "title": "inset()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/basic-shape/inset",
    "summary": "The inset() CSS function is one of the <basic-shape> data types. It defines an inset rectangle."
  },
  {
    "title": "box-pack",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-pack",
    "summary": "The -moz-box-pack and -webkit-box-pack CSS properties specify how a -moz-box or -webkit-box packs its contents in the direction of its layout. The effect of this is only visible if there is extra space in the box."
  },
  {
    "title": "scaleY()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scaleY",
    "summary": "The scaleY() CSS function defines a transformation that resizes an element along the\n  y-axis (vertically). Its result is a <transform-function> data type."
  },
  {
    "title": "skewX()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/skewX",
    "summary": "The skewX() CSS function defines a transformation that skews an element in the\n  horizontal direction on the 2D plane. Its result is a <transform-function> data type."
  },
  {
    "title": "additive-symbols",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/additive-symbols",
    "summary": "The additive-symbols descriptor lets you specify symbols when the value of a counter system descriptor is additive. The additive-symbols descriptor defines additive tuples, each of which is a pair containing a symbol and a non-negative integer weight. The additive system is used to construct sign-value numbering systems such as Roman numerals."
  },
  {
    "title": "device-aspect-ratio",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/device-aspect-ratio",
    "summary": "The device-aspect-ratio CSS media feature can be used to test the width-to-height aspect ratio of an output device."
  },
  {
    "title": "scripting",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/scripting",
    "summary": "The scripting CSS media feature can be used to test whether scripting (such as JavaScript) is available."
  },
  {
    "title": "rotateZ()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/rotateZ",
    "summary": "The rotateZ() CSS function defines a transformation that rotates an element around the\n  z-axis without deforming it. Its result is a <transform-function> data type."
  },
  {
    "title": ":host-context()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:host-context",
    "summary": "The :host-context() CSS pseudo-class function selects the shadow host of the shadow DOM containing the CSS it is used inside (so you can select a custom element from inside its shadow DOM) — but only if the selector given as the function's parameter matches the shadow host's ancestor(s) in the place it sits inside the DOM hierarchy."
  },
  {
    "title": ":nth-last-col",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:nth-last-col",
    "summary": "The :nth-last-col() CSS pseudo-class is designed for tables and grids. It accepts the An+B notation such as used with the :nth-child selector, using this to target every nth column before it, therefore counting back from the end of the set of columns. The values odd and even are also valid."
  },
  {
    "title": "ascent-override",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/ascent-override",
    "summary": "The ascent-override CSS descriptor defines the ascent metric for the font. The ascent metric is the height above the baseline that CSS uses to lay out line boxes in an inline formatting context."
  },
  {
    "title": "inverted-colors",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/inverted-colors",
    "summary": "The inverted-colors CSS media feature can be used to test whether the user agent or underlying OS is inverting colors."
  },
  {
    "title": ":future",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:future",
    "summary": "The :future CSS pseudo-class selector is a time-dimensional pseudo-class that will match for any element which appears entirely after an element that matches :current. For example in a video with captions which are being displayed by WebVTT."
  },
  {
    "title": "system",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/system",
    "summary": "The system descriptor specifies the algorithm to be used for converting the integer value of a counter to a string representation. It is used in a @counter-style to define the behavior of the defined style."
  },
  {
    "title": "speak-as",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/speak-as",
    "summary": "The speak-as descriptor specifies how a counter symbol constructed with a given @counter-style will be represented in the spoken form. For example, an author can specify a counter symbol to be either spoken as its numerical value or just represented with an audio cue."
  },
  {
    "title": "ellipse()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/basic-shape/ellipse",
    "summary": "The ellipse() CSS function is one of the <basic-shape> data types."
  },
  {
    "title": "font-variation-settings",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/font-variation-settings",
    "summary": "The font-variation-settings CSS descriptor allows authors to specify low-level OpenType or TrueType font variations in the @font-face rule."
  },
  {
    "title": "overflow-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/overflow-block",
    "summary": "The overflow-block CSS media feature can be used to test how the output device handles content that overflows the initial containing block along the block axis."
  },
  {
    "title": "update",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/update-frequency",
    "summary": "The update CSS media feature can be used to test how frequently (if at all) the output device is able to modify the appearance of content."
  },
  {
    "title": "paint-order",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/paint-order",
    "summary": "The paint-order CSS property lets you control the order in which the fill and stroke (and painting markers) of text content and shapes are drawn."
  },
  {
    "title": "symbols()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/symbols",
    "summary": "The symbols() CSS function lets you define counter styles inline, directly as the value of a property such as list-style. Unlike @counter-style, symbols() is anonymous (i.e., it can only be used once). Although less powerful, it is shorter and easier to write than @counter-style."
  },
  {
    "title": "repeating-radial-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/repeating-radial-gradient",
    "summary": "The repeating-radial-gradient() CSS function creates an image consisting of repeating gradients that radiate from an origin. It is similar to radial-gradient() and takes the same arguments, but it repeats the color stops infinitely in all directions so as to cover its entire container, similar to repeating-linear-gradient(). The function's result is an object of the <gradient> data type, which is a special kind of <image>."
  },
  {
    "title": "color",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/color",
    "summary": "The color CSS media feature can be used to test the number of bits per color component (red, green, blue) of the output device."
  },
  {
    "title": "CSS Tutorials",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/Tutorials",
    "summary": "Learning CSS may be a daunting task.\n  In order to help you, we have written numerous tutorials about CSS.\n  Some are aimed at complete beginners, while others present complex features to be used by more experienced users."
  },
  {
    "title": "prefers-reduced-data",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-reduced-data",
    "summary": "The prefers-reduced-data CSS media feature is used to detect if the user has requested the web content that consumes less internet traffic."
  },
  {
    "title": "CSS.registerProperty()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/API/CSS/RegisterProperty",
    "summary": "The CSS.registerProperty() method registers\n  custom properties, allowing for property type checking, default\n  values, and properties that do or do not inherit their value."
  },
  {
    "title": "suffix",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/suffix",
    "summary": "The suffix descriptor of the@counter-style rule specifies content that will be appended to the marker representation."
  },
  {
    "title": "CSS.paintWorklet",
    "url": "https://developer.mozilla.org/en-US/docs/Web/API/CSS/paintWorklet",
    "summary": "paintWorklet is a static,\n  read-only property of the CSS interface that provides access to the\n  PaintWorklet, which programmatically generates an image where a CSS\n  property expects a file."
  },
  {
    "title": ":past",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/:past",
    "summary": "The :past CSS pseudo-class selector is a time-dimensional pseudo-class that will match for any element which appears entirely before an element that matches :current. For example in a video with captions which are being displayed by WebVTT."
  },
  {
    "title": "negative",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/negative",
    "summary": "When defining custom counter styles, the negative descriptor lets you alter the representations of negative counter values, by providing a way to specify symbols to be appended or prepended to the counter representation when the value is negative."
  },
  {
    "title": "pad",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/pad",
    "summary": "The pad descriptor can be used with custom counter style definitions when you need the marker representations to have a minimum length."
  },
  {
    "title": "range",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@counter-style/range",
    "summary": "When defining custom counter styles, the range descriptor lets the author specify a range of counter values over which the style is applied. If a counter value is outside the specified range, then the fallback style will be used to construct the representation of that marker."
  },
  {
    "title": "descent-override",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/descent-override",
    "summary": "The descent-override CSS descriptor defines the descent metric for the font. The descent metric is the height below the baseline that CSS uses to lay out line boxes in an inline formatting context."
  },
  {
    "title": "line-gap-override",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@font-face/line-gap-override",
    "summary": "The line-gap-override CSS descriptor defines the line-gap metric for the font. The line-gap metric is the font recommended line-gap or external leading."
  },
  {
    "title": "aural",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/aural",
    "summary": "The aural CSS media type is used for devices that have speech output capabilities."
  },
  {
    "title": "color-index",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/color-index",
    "summary": "The color-index CSS media feature can be used to test the number of entries in the output device's color lookup table."
  },
  {
    "title": "grid",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/grid",
    "summary": "The grid CSS media feature can be used to test whether the output device uses a grid-based screen."
  },
  {
    "title": "monochrome",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/monochrome",
    "summary": "The monochrome CSS media feature can be used to test the number of bits per pixel in the monochrome frame buffer of the output device."
  },
  {
    "title": "overflow-inline",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/overflow-inline",
    "summary": "The overflow-inline CSS media feature can be used to test how the output device handles content that overflows the initial containing block along the inline axis."
  },
  {
    "title": "shape",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@media/shape",
    "summary": "The shape CSS media feature can be used to test the shape of the device to distinguish rectangular and round displays."
  },
  {
    "title": "inherits",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@property/inherits",
    "summary": "The inherits CSS descriptor is required when using the @property at-rule and controls whether the custom property registration specified by @property inherits by default."
  },
  {
    "title": "initial-value",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@property/initial-value",
    "summary": "The initial-value CSS descriptor is required when using the @property at-rule unless the syntax accepts any valid token stream. It sets the initial-value for the property."
  },
  {
    "title": "syntax",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/@property/syntax",
    "summary": "The syntax CSS descriptor is required when using the @property at-rule and describes the allowable syntax for the property."
  },
  {
    "title": "Questions about CSS",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/FAQ",
    "summary": "Cascading Style Sheets (CSS) is a rule-based language allowing developers to define styles to apply to HTML elements (or other markup structures)."
  },
  {
    "title": "abs()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/abs",
    "summary": "The abs() CSS function contains one calculation, and returns the absolute value of the argument, as the same type as the input."
  },
  {
    "title": "box-direction",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-direction",
    "summary": "The box-direction CSS property specifies whether a box lays out its contents normally (from the top or left edge), or in reverse (from the bottom or right edge)."
  },
  {
    "title": "box-flex-group",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-flex-group",
    "summary": "The box-flex-group CSS property assigns the flexbox's child elements to a flex group."
  },
  {
    "title": "box-lines",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-lines",
    "summary": "The box-lines CSS property determines whether the box may have a single or multiple lines (rows for horizontally oriented boxes, columns for vertically oriented boxes)."
  },
  {
    "title": "box-ordinal-group",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/box-ordinal-group",
    "summary": "The box-ordinal-group CSS property assigns the flexbox's child elements to an ordinal group."
  },
  {
    "title": "contain-intrinsic-size",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/contain-intrinsic-size",
    "summary": "The contain-intrinsic-size CSS property controls the natural size of an element specified by content-visibility."
  },
  {
    "title": "counters()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/counters",
    "summary": "The counters() CSS function enables nested counters, returning a concatenated string representing the current values of the named counters, if there are any. The counters() function has two forms: counters(name, string) or counters(name, string, style). It is generally used with pseudo-elements, but can be used, theoretically, anywhere a <string> value is supported. The generated text is the value of all counters with the given name, from outermost to innermost, separated by the specified string. The counters are rendered in the style indicated, defaulting to decimal if no style is specified."
  },
  {
    "title": "repeating-conic-gradient()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/gradient/repeating-conic-gradient",
    "summary": "The repeating-conic-gradient() CSS function creates an image consisting of a repeating gradient (rather than a single gradient) with color transitions rotated around a center point (rather than radiating from the center)."
  },
  {
    "title": "paint()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/image/paint",
    "summary": "The paint() CSS function defines an <image> value generated with a PaintWorklet."
  },
  {
    "title": "justify-tracks",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/justify-tracks",
    "summary": "The justify-tracks CSS property sets the alignment in the masonry axis for grid containers that have masonry in their inline axis."
  },
  {
    "title": "math-style",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/math-style",
    "summary": "The math-style property indicates whether MathML equations should render with normal or compact height."
  },
  {
    "title": "revert-layer",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/revert-layer",
    "summary": "The revert-layer CSS keyword rolls back the value of a property in a cascade layer to the value of the property in a CSS rule matching the element in a previous cascade layer. The value of the property with this keyword is recalculated as if no rules were specified on the target element in the current cascade layer."
  },
  {
    "title": "scroll-margin-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-block",
    "summary": "The scroll-margin-block shorthand property sets the scroll margins of an element in the block dimension."
  },
  {
    "title": "scroll-margin-block-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-block-end",
    "summary": "The scroll-margin-block-end property defines the margin of the scroll snap area at the end of the block dimension that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "scroll-margin-block-start",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-block-start",
    "summary": "The scroll-margin-block-start property defines the margin of the scroll snap area at the start of the block dimension that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "scroll-margin-inline-end",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-margin-inline-end",
    "summary": "The scroll-margin-inline-end property defines the margin of the scroll snap area at the end of the inline dimension that is used for snapping this box to the snapport. The scroll snap area is determined by taking the transformed border box, finding its rectangular bounding box (axis-aligned in the scroll container's coordinate space), then adding the specified outsets."
  },
  {
    "title": "scroll-padding-block",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-padding-block",
    "summary": "The scroll-padding-block shorthand property sets the scroll padding of an element in the block dimension."
  },
  {
    "title": "scroll-snap-type-x",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-type-x",
    "summary": "The scroll-snap-type-x CSS property defines how strictly snap points are enforced on the horizontal axis of the scroll container in case there is one."
  },
  {
    "title": "scroll-snap-type-y",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/scroll-snap-type-y",
    "summary": "The scroll-snap-type-y CSS property defines how strictly snap points are enforced on the vertical axis of the scroll container in case there is one."
  },
  {
    "title": "scaleZ()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/scaleZ",
    "summary": "The scaleZ() CSS function defines a transformation that resizes an element along the\n  z-axis. Its result is a <transform-function> data type."
  },
  {
    "title": "skewY()",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/transform-function/skewY",
    "summary": "The skewY() CSS function defines a transformation that skews an element in the vertical\n  direction on the 2D plane. Its result is a <transform-function> data type."
  },
  {
    "title": "user-modify",
    "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/user-modify",
    "summary": "The user-modify property has no effect in Firefox. It was originally planned to determine whether or not the content of an element can be edited by a user."
  }
]
